<?xml version='1.0' encoding='iso-8859-1'?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de" dir="ltr">

<head> 
	<meta content="text/html; charset=ISO-8859-1" http-equiv="content-type" />
	<title>Archive Table</title>
</head>

<body>
<h1>Archive Table</h1>
<p><img alt="" src="./image/ArchiveOverview.png" /></p>
<p align="justify">Archive Table zeigt &auml;ltere Nachrichten aus dem Archiv. 
F&uuml;r eine Anfrage wird eine Anforderung an den Datenbank-Server geschickt. Deswegen kann
bei komplizierten Filterbedingungen die Antwort bis zu 30 Sekunden dauern.<br /></p>
	
<h2>Requests</h2>
<p><img alt="" src="./image/ArchiveSelectButtons.png" /></p>

<h3>Tag, 3 Tage, Woche</h3>
<p align="justify">Anfordern aller Nachrichten f&uuml;r die Zeitr&auml;ume  'Tag', '3 Tage' oder 'Woche'.</p>

<h3>User</h3>
<p><img alt="" src="./image/Calendar.png" /></p>
<p align="justify">Das Zeitfenster f&uuml;r die Datenbankanforderung kann manuell gesetzt werden.
Im Kalender links kann die Startzeit ausgew&auml;hlt werden. Im Kalender rechts kann die Endzeit ausgew&auml;hlt werden. </p>

<h3>Expert</h3>
<p><img alt="" src="./image/TimePeriodCondition.png" /></p>
<p align="justify"> Die Bedienung der Zeiteinstellung funktioniert wie 'user button'. 
In den zus&auml;tzlichen Feldern unten im Window k&ouml;nnen Filterbedingungen gesetzt werden.
Die Drop-Down-Liste links enth&auml;lt alle verf&uuml;gbaren Schl&uuml;sselworte der Eigenschaften von Nachrichten.
Im Textfeld in der Mitte steht die Zeichenkette, die im Inhalt der Nachricht vorkommen soll.
Auf der rechten Seite stehen die Operatoren ('AND', 'OR') , mit denen die Filterbedingungen verkn&uuml;pft werden.
<br />
Im Beispiel ist die erste Filterbedingung  'message property 'TYPE'. Sie ist auf den Wert 'event' gesetzt. Sie wird
mit 'AND' mit der zweiten Bedingung 'message property 'HOST' verbunden, die auf den Wert 'berndTest' gesetzt ist. </p>

<h2>Time period</h2>
<p><img alt="" src="./image/TimePeriod.png" /></p>
<p align="justify">Anfang und Ende der Zeitspanne der aktuellen Auswahl.</p>

<h2>Number of result messages</h2>
<p><img alt="" src="./image/ResultNumber.png" /></p>
<p align="justify">Anzahl der Nachrichten in der Datenbank-Antwort. Ein roter Hintergrund und der Zusatz '(maximum)'
zeigen an, dass weitere Eintr&auml;ge in der Datenbank vorhanden sind, aber nicht in der Tabelle erscheinen.
Die maximale Anzahl von Nachrichten ist eingeschr&auml;nkt, um eine bessere Performanz zu erhalten.
Sie kann in Eigenschaften (Menu 'CSS' &rarr; 'CSS-applications' &rarr; 'Alarm'
&rarr; 'JMS Logs' &rarr; 'JMS log archive viewer' &rarr; 'Maximum number for result') gesetzt / ver&auml;ndert werden.</p>

<h2>Export messages</h2>
<p><img alt="" src="./image/ExportButton.png" /></p>
<p align="justify">Der 'Export Button' schreibt alle aktuell ausgew&auml;hlten Nachrichten im Excel-Format in eine Datei.
Die maximale Anzahl von Nachrichten ist eingeschr&auml;nkt und kann im preferences-Menu konfiguriert werden:
Menu 'CSS' &rarr; 'CSS-applications' &rarr; 'Alarm'
&rarr; 'JMS Logs' &rarr; 'JMS log archive viewer' &rarr; 'Maximum number for export'</p>
<p><img alt="" src="./image/DeleteButton.png" /></p>
<p align="justify">L&ouml;sche alle aktuell ausgew&auml;hlten Nachrichten aus der Datenbank.
ACHTUNG: Auch wenn die Tabelle nicht alle Nachrichten darstellt, werden sie aus der Datenbank gel&ouml;scht.</p>

<h2>Context Menu</h2>
<p><img alt="" src="./image/LogTableContextMenu.png" /></p>
<p align="justify">Das Kontextmenu &ouml;ffnet sich durch Rechtsklick auf eine Nachricht / Tabellenzeile :</p>
<p>
<img alt="" src="./image/ContextIconShowProperties.png" />Zeigt alle Eigenschaften der ausgew&auml;hlten Nachricht in einer externen Tabellenansicht.<br />
<img alt="" src="./image/ContextIconShowProperties.png" />Verschickt die Eigenschaften der ausgew&auml;hlten Nachricht per e-mail.<br />
<img alt="" src="./image/ContextIconDelete.png" /> L&ouml;scht die ausgew&auml;hlte Nachricht vom log view.<br />
<img alt="" src="./image/ContextIconDelete.png" /> L&ouml;scht alle Nachricht vom log view.<br />
<img alt="" src="./image/ContextMenuClipboard.png" /> Kopiert den Wert der Eigenschaft NAME in die Windows-Zwischenablage.<br />
<img alt="" src="./image/ContextMenuCSS.png" /> Startet weitere Anwendungen / plug-ins aus der aktuellen
CSS-Installation, die mit Prozessvariablen arbeiten. Diese Option ist nur sinnvoll,
wenn die Eigenschaft NAME der ausgew&auml;hlten Nachricht eine Prozessvariable ist.<br />
</p>

<p>
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
<br />
</p>
</body>
</html>