<?xml version='1.0' encoding='iso-8859-1'?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de" dir="ltr">
	
<head>
	<meta content="text/html; charset=ISO-8859-1" http-equiv="content-type" />
	<title>Alarm Tree Developer's Guide</title>
</head>

<body>
<h1>Alarm Tree Developer's Guide</h1>
<p>Dieses Dokument beschreibt die Implementation des Alarm-Tree-Plugins.
	Der Alarm-Tree liest seine Struktur von einem LDAP-Directory und empf&auml;ngt Updates
	der Alarmzust&auml;nde &uuml;ber JMS. Alarmzust&auml;nde werden hierarchisch fortgepflanzt,
	so dass Mutterknoten den schwersten Alarmzustand ihrer Kinder anzeigen.</p>
<p>Benutzeraktionen im Baum werden durch Auswahl von Knoten und Starten von Aktionen 
	aus dem Kontextmenu des Baums ausgef&uuml;hrt.</p>
	
<h2>Initialization</h2>
<p>Wenn  eine View erzeugt wird, verbindet das Plug-In zuerst mit den JMS-Servern.
	Wenn die Verbindung steht, wird die Struktur des Alarm-Trees vom LDAP-Server gelesen.
	W&auml;hrend des Lesesn der Baumstruktur empfangenen JMS-Nachrichten werden gequeuet und 
	erst verarbeitet, nachdem das Lesen abgeschlossen ist. Einzelheiten siehe im Quellcode.</p>
<p>Die Verbindung mit JMS und das Lesen des LDAP-Baums werden im Hintergrund ausgef&uuml;hrt,
	damit das Benutzer-Interface nicht "einfriert". Der JMS-Verbindungs-Job startet (schedules)
	den LDAP-Lese-Job, sobald die JMS-Verbindung aufgebaut ist; und ein Listener-Prozess, der mit dem
	LDAP-Reader verbunden ist, aktualisiert das User-Interface und setzt den Tree als Ziel f&uuml;r Alarm-Nachrichten, 
	die &uuml;ber JMS empfangen werden, wenn der LDAP-Lese-Job getan ist.</p>
	
<h2>Propagating severity changes</h2>
<p>Alarm-Zust&auml;nde werden vom LDAP-Reader und vom JMS-Listener auf die Blatt-Knoten gesetzt.
Die Blatt-Knoten sind vom Typ <code>ProcessVariableNode</code> und repr&auml;sentieren PV-Records.
Wenn ihr Alarm-Zustand ge&auml;ndert wird, 
(s. Methoden <code>setActiveAlarm</code> und <code>setHighestUnacknowledgedAlarm</code>),
verst&auml;ndigen sie ihre Eltern-Knoten &uuml;ber diese &Auml;nderung. Der Eltern-Knoten checkt 
dann, ob es n&ouml;tig ist, seinen Alarmzustand zu &auml;ndern, verst&auml;ndigt, wenn n&ouml;tig, seinen Eltern-Knoten,
u.s.w., bis der Baum abgearbeitet ist.</p>

<h2>Context menu actions</h2>
<p>Benutzer k&ouml;nnen Aktionen mit Hilfe des Tree-Kontext-Menus ausf&uuml;hren. 
Die Aktionen werden in <code>AlarmTreeView#makeActions</code> erzeugt und
in Instanzen-Feldern von <code>AlarmTreeView</code> gespeichert.
Das Kontext-Menu wird in der <code>initializeContextMenu</code>-Methode
erzeugt und in der <code>fillContextMenu</code>-Methode mit Items gef&uuml;llt.
Diese Methode f&uuml;gt auf Grundlage der aktuellen Auswahl Menu-Items hinzu.
</p>
<p>Beispielsweise wird die &quot;Run alarm display&quot;-Aktion nur hinzugef&uuml;gt, wenn 
genau ein PV-Node ausgew&auml;hlt ist (d.h. die Aktion ist nicht verf&uuml;gbar, wenn mehrere
Nodes ausgew&auml;hlt sind oder wenn der ausgew&auml;hlte Knoten kein Record, sondern ein Mutter-Knoten ist) :</p>

<pre>	if (selection.size() == 1
		&amp;&amp; selection.getFirstElement() instanceof ProcessVariableNode) {
	menu.add(runCssAlarmDisplayAction);
}
</pre>

<p>Der <code>AlarmTreeView</code> lauscht auch auf Auswahl-&Auml;nderungen und aktiviert/disaktiviert 
	die Aktionen, die auf den ausgew&auml;hlten Knoten beruhen.
	Beispielsweise wird die &quot;Run alarm display&quot;-Aktion disaktiviert,
	wenn kein Alarm-Display f&uuml;r die ausgew&auml;hlten Knoten konfiguriert ist.
	
</p>
<p>Um zus&auml;tzliche Items zum Kontext-Menu hinzuzuf&uuml;gen, muss man :
</p>
<ul>
<li>die Aktion, die man als eine Subklasse von <code>org.eclipse.jface.action.Action</code>
	laufen lassen m&ouml;chte, implementieren.</li>
<li>die Aktion in der <code>fillContextMenu</code>-Methode zum Kontextmenu hinzuf&uuml;gen/</li>
<li>optional Code zur <code>selectionChanged</code>-Methode hinzuf&uuml;gen, um die Aktion, die
	auf der aktuellen Auswahl beruht, zu aktivieren oder zu disaktivieren.</li>
</ul>
</body>
</html>