<?xml version='1.0' encoding='iso-8859-1'?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de" dir="ltr">

<head>
	<meta content="text/html; charset=ISO-8859-1" http-equiv="content-type" />
	<title>Alarm Tree User's Guide</title>
</head>

<body>
<h1>Alarm Tree User's Guide</h1>
<p>Dies ist der User-Guide f&uuml;r Alarm-Tree.</p>
<h2>Preferences</h2>
<p>Die Preference-Page f&uuml;r den Alarm-Tree ist <i>CSS Applications &gt; Alarm
&gt; Alarm Tree</i>.</p>
<p>Zuerst sicherstellen, dass der LDAP-Directory-Server und die JMS-Server richtig
aufgesetzt sind. Aus Redundanzgr&uuml;nden lauscht der Alarm-Tree auf zwei JMS-Server.
Wenn man die JMS Settings &auml;ndert, nachdem der Tree schon l&auml;uft, ist ein Restart des
Trees erforderlich.</p>
<p>Nach Aufsetzten der Server kann man die <i>Facility names</i> list benutzen, um
die Facilities hinzuzuf&uuml;gen, die man im Tree angezeigt haben m&ouml;chte.
Man kann eine beliebige Anzahl von Facilities ausw&auml;hlen. Man kann die LDAP Settings und 
die Facility-Auswahl sogar &auml;ndern, wenn der Tree schon l&auml;uftt. Einfach auf den 
&quot;Reload&quot;-Button in der Tree-Toolbar klicken, nachdem die neuen Preferences 
gesichert sind. Der Alarm-Tree benutzt dann ab dem Reload die neuen Settings.</p>

<h2>Using the view</h2>
<h3>Icons</h3>
<p>Die View zeigt jeden Knoten mit farbigen Kreisen an, welche den aktuellen 
Alarmzustand abbilden, und, wenn zutreffend, den schwerwiegensten Alarm, 
der noch nicht quittiert ist.
Die Farben haben die folgende Bedeutungen:</p>
<ul>
<li>Blau: invalid</li>
<li>Rot: major</li>
<li>Gelb: minor</li>
<li>Gr&uuml;n: alarm</li>
</ul>
<p>Das Icon rechts im Vordergrund zeigt immer den aktuellen Alarmzustand an. Wenn der
aktuelle Alarm quittiert wurde, wird oben im Alarm-Icon ein H&auml;kchen eingeblendet.
Wenn es f&uuml;r den Knoten alte Alarme gibt, die h&ouml;heres Gewicht als der aktuelle Alarm haben
und die noch nicht quittiert sind, wird ein zweites Icon links hinter dem prim&auml;ren Icon ausgegeben.
</p>
<p>F&uuml;r die Blatt-Knoten, die individuelle Records (Prozess-variable) darstellen, zeigt das Icon den
Alarmzustand dieses Records an. F&uuml;r Knoten, die Child-Knoten haben, zeigt das Icon den
h&ouml;chsten Alarmzustand seiner Kinder.</p>
<h3>Acknowledging alarms</h3>
<p>Wenn ein Knoten unquittierte Alarmzust&auml;nde enth&auml;lt, kann man das Kontextmenu des Knotens benutzen,
um Quittungsmeldungen f&uuml;r diesen Knoten zu senden. Man beachte, dass der Knoten nicht sofort als
quittiert dargestellt wird. Der Tree aktualisiert den Zustand des Knotens, sobald er die 
Quittungsmeldung empfangen hat.</p>
<p>Eine Quittierung quittiert immer sowohl den aktuellen Alarm, als auch alle vorherigen
unquittierten Alarme. Wenn der ausgew&auml;hlte Knoten ein Parent-Knoten ist, wird f&uuml;r jedes Child,
welches unquittierte Alarme hat, eine Quittungsmeldung gesendet.</p>
<h3>Opening the alarm display</h3>
<p>Falls ein Alarm-Display f&uuml;r einen Record im LDAP-Directory konfiguriert ist,
kann man dieses Alarm-Display aus dem Kontextmenu mit Hilfe der &quot;Run alarm
display&quot;-Action &ouml;ffnen.
Man beachte, dass dieses Menu-Item nur erscheint, wenn ein einzelner Blatt-Knoten ausgew&auml;hlt ist.	
Es ist nicht verf&uuml;gbar f&uuml;r Parent-Knoten oder Vielfach-Auswahlen.
Wenn der Menu-Item ausgegraut erscheint, ist f&uuml;r diese Prozessvariable kein Alarm-Display konfiguriert,
oder das Attribut 'value' sieht nicht wie ein g&uuml;ltiger CSS-Display-Dateiname aus (Dateiname muss mit
.css-sds enden).</p>

<h2>Editing Support</h2>
<p>Die View enth&auml;lt Unterst&uuml;tzung zum Editieren des LDAP-Directories, welches die
Struktur des Knotens enth&auml;lt, der in der View dargestellt wird.</p>
<h3>Using the context menu</h3>
<p>Das Kontextmenu f&uuml;r einen Knoten enth&auml;lt Menu-Items zum L&ouml;schen des Knotens.
F&uuml;r Knoten, die keine Channels sind, enth&auml;lt es auch Menu-Items zum Erzeugen 
einer neuen Komponente oder Subkomponente unterhalb des ausgew&auml;hlten Knotens
und zum Erzeugen eines neuen Channels innerhalb des ausgew&auml;hlten Knotens. 
Ob eine Komponente oder Subkomponente erzeugt wird, wird automatisch bestimmt:
Wenn der ausgew&auml;hlte Knoten ein Facility ist, kann man Kompnenten-Knoten erzeugen;
wenn er eine Komponente oder Subkomponente ist, kann man Subkomponenten erzeugen.
</p>
<p>Man beachte, dass das L&ouml;schen nicht rekursiv arbeitet, d.h. man kann nur Knoten l&ouml;schen,
die keine Subknoten enthalten. Das liegt einerseits an den Einschr&auml;nkungen des LDAP-Servers und
sch&uuml;tzt andereseits gegen zuf&auml;lliges L&ouml;schen grosser Trees.
</p>
<h3>Using drag&amp;drop</h3>
<p>Zus&auml;tzlich zur Benutzung des Kontextmenus kann man auch die drag&amp;drop
-Features des Control-System-Studios benutzen, um weitere Channels zum Tree hinzuzuf&uuml;gen.
Einfach in irgendeiner View, die drag&amp;drop unterst&uuml;tzt, einen oder mehrere Channels 
ausw&auml;hlen und in den Alarm-Tree reinziehen. W&auml;hrend man Items &uuml;ber den Tree zieht, 
&auml;ndert sich der Maus-Cursor, um anzuzeigen, wo man die Channels loslassen kann.</p>
<p>Man beachte, dass der Tree z.Zt. nur unterst&uuml;tzt, Items in den Tree zu ziehen.
Man kann nicht Channel-Namen oder andere Knoten aus dem Tree heraus in andere Views ziehen.
Diese M&ouml;glichkeiten werden wohl in einer zuk&uuml;nftigen Version verf&uuml;gbar sein.</p>
<h3>Editing the properties of nodes</h3>
<p>Man kann die Eclipse Property View benutzen, um die Eigenschaften der Knoten im Tree zu 
editieren. Die Eigenschaften werden als Attribute im LDAP-Verzeichnis gespreichert.
Die Property View kann durch Anklicken des &quot;Property View&quot;-Buttons in
der Toolbar der View ge&ouml;ffnet werden.</p>
<p>Folgende Eigenschaften sind verf&uuml;gbar</p>
<dl>
<dt>Alarm display</dt>
<dd>
Der Dateiname des Alarm-Displays, das mit dem Knoten verkn&uuml;pft ist.
Wenn diese Eigenschaft den Namen einer CSS-SDS-Display-Datei enth&auml;lt, kann man
das Display aus dem Kontextmenu im Alarm-Tree &ouml;ffnen.</dd>
<dt>Display</dt>
<dd>
Der Dateiname des Displays, das mit dem Knoten verkn&uuml;pft ist.	
Wenn diese Eigenschaft den Namen einer CSS-SDS-Display-Datei enth&auml;lt, kann man
das Display aus dem Kontextmenu im Alarm-Tree &ouml;ffnen.</dd>
<dt>Help guidance</dt>
<dd>Eine Kurzbeschreibung des Knotens.</dd>
<dt>Help page</dt>
<dd>URL einer WEB-Seite, welche weitergehende Information &uuml;ber den Knoten enth&auml;lt.</dd>
<dt>Name</dt>
<dd>Der Name des Knotens. Diese Eigenschaft kann nicht editiert werden.</dd>
<dt>Object class</dt>
<dd>Die Objektklasse des Eintrags im LDAP-Verzeichnis. Diese Eigenschaft kann nicht editiert werden.</dd>
<dt>Strip chart</dt>
<dd>Der Dateiname einer Strip-Chart-Datei, die mit dem Knoten verkn&uuml;pft ist.
Wenn diese Eigenschaft gesetzt ist, kann die Datei vom Kontextmenue aus ge&ouml;ffnet werden.</dd>
</dl>
<p>
Man beachte, dass Dateinamen (Pfade) relativ zum CSS-Workspace gesetzt sein m&uuml;ssen.
Besipiel: Der Dateiname &quot;/SDS/displays/example.css-sds&quot; zeigt auf die Datei
&quot;example.css-sds&quot; im Unterverzeichnis &quot;displays&quot; welches im
&quot;SDS&quot;-Projekt des Workspace liegt.</p>
</body>
</html>