Repository: ControlSystemStudio/cs-studio
Catalog: project/documentation/manual/src/main/docbook/*/content/component_mapping.po
Languages: fr_fr

source: Component Mapping
fr_fr: Mappage de composants

source: The notion of a <emphasis>component</emphasis> is re-used in several different contexts and purposes throughout Hibernate.
fr_fr: La notion de <emphasis>composants</emphasis> est réutilisée dans différents contextes, avec différents objectifs, à travers Hibernate.

source: Dependent objects
fr_fr: Objets dépendants

source: A component is a contained object that is persisted as a value type and not an entity reference. The term "component" refers to the object-oriented notion of composition and not to architecture-level components. For example, you can model a person like this:
fr_fr: Le composant est un objet inclus dans un autre objet, sauvegardé en tant que type valeur, et non en tant que référence entité. Le terme "composant" fait référence à la notion (au sens objet) de composition et non pas de composant au sens d'architecture de composants. Par exemple, on pourrait modéliser l'objet personne de la façon suivante :

source: Now <literal>Name</literal> can be persisted as a component of <literal>Person</literal>. <literal>Name</literal> defines getter and setter methods for its persistent properties, but it does not need to declare any interfaces or identifier properties.
fr_fr: Maintenant <literal>Name</literal> pourra être sauvegardé en tant que composant de <literal>Person</literal>. Remarquez que <literal>Name</literal> définit des méthodes getter et setter pour ses propriétés persistantes, mais ne doit déclarer aucune interface ou propriété d'identification.

source: Our Hibernate mapping would look like this:
fr_fr: Dans Hibernate le mappage du composant serait :

source: The person table would have the columns <literal>pid</literal>, <literal>birthday</literal>, <literal>initial</literal>, <literal>first</literal> and <literal>last</literal>.
fr_fr: La table "person" aurait les colonnes <literal>pid</literal>, <literal>birthday</literal>, <literal>initial</literal>, <literal>first</literal> et <literal>last</literal>.

source: Like value types, components do not support shared references. In other words, two persons could have the same name, but the two person objects would contain two independent name objects that were only "the same" by value. The null value semantics of a component are <emphasis>ad hoc</emphasis>. When reloading the containing object, Hibernate will assume that if all component columns are null, then the entire component is null. This is suitable for most purposes.
fr_fr: Comme tous les types valeurs, les composants ne supportent pas les références partagées. En d'autres termes, deux instances de person peuvent avoir un même nom, mais ces noms sont indépendants, ils peuvent être identiques si on les compare par valeur mais ils représentent deux objets distincts en mémoire. La sémantique de la valeur null d'un composant est <emphasis>ad hoc</emphasis>. Quand il recharge l'objet qui contient le composant, Hibernate suppose que si toutes les colonnes de composants sont nulles, le composant est positionné à la valeur null. Ce choix programmatif devrait être satisfaisant dans la plupart des cas.

source: The properties of a component can be of any Hibernate type (collections, many-to-one associations, other components, etc). Nested components should <emphasis>not</emphasis> be considered an exotic usage. Hibernate is intended to support a fine-grained object model.
fr_fr: Les propriétés d'un composant peuvent être de tous les types habituellement supportés par Hibernate (collections, associations plusieurs-à-un, autres composants, etc). Les composants imbriqués ne doivent <emphasis>pas</emphasis> être vus comme quelque chose d'exotique. Hibernate a été conçu pour supporter un modèle d'objet finement granulé.

source: The <literal>&lt;component&gt;</literal> element allows a <literal>&lt;parent&gt;</literal> subelement that maps a property of the component class as a reference back to the containing entity.
fr_fr: L'élément <literal>&lt;component&gt;</literal> permet de déclarer un sous-élément <literal>&lt;parent&gt;</literal> qui associe une propriété de la classe composant comme une référence arrière vers l'entité contenante.

source: Collections of dependent objects
fr_fr: Collection d'objets dépendants

source: Collections of components are supported (e.g. an array of type <literal>Name</literal>). Declare your component collection by replacing the <literal>&lt;element&gt;</literal> tag with a <literal>&lt;composite-element&gt;</literal> tag:
fr_fr: Les collections d'objets dépendants sont supportées (exemple: un tableau de type <literal>Name</literal>). Déclarez votre collection de composants en remplaçant la balise <literal>&lt;element&gt;</literal> par la balise <literal>&lt;composite-element&gt;</literal> :

source: If you define a <literal>Set</literal> of composite elements, it is important to implement <literal>equals()</literal> and <literal>hashCode()</literal> correctly.
fr_fr: Remarque : si vous définissez un <literal>Set</literal> d'éléments composites, il est très important d'implémenter les méthodes <literal>equals()</literal> et <literal>hashCode()</literal> correctement.

source: Composite elements can contain components but not collections. If your composite element contains components, use the <literal>&lt;nested-composite-element&gt;</literal> tag. This case is a collection of components which themselves have components. You may want to consider if a one-to-many association is more appropriate. Remodel the composite element as an entity, but be aware that even though the Java model is the same, the relational model and persistence semantics are still slightly different.
fr_fr: Les éléments composites peuvent aussi contenir des composants mais pas des collections. Si votre élément composite contient aussi des composants, utilisez la balise <literal>&lt;nested-composite-element&gt;</literal>. Une collection de composants qui contiennent eux-mêmes des composants est un cas très exotique. A ce stade, demandez-vous si une association un-à-plusieurs ne serait pas plus appropriée. Essayez de remodeler votre élément composite comme une entité - remarquez que si le modèle Java est le même, toutefois le modèle relationnel et la sémantique de persistance diffèrent quelque peu.

source: A composite element mapping does not support null-able properties if you are using a <literal>&lt;set&gt;</literal>. There is no separate primary key column in the composite element table. Hibernate uses each column's value to identify a record when deleting objects, which is not possible with null values. You have to either use only not-null properties in a composite-element or choose a <literal>&lt;list&gt;</literal>, <literal>&lt;map&gt;</literal>, <literal>&lt;bag&gt;</literal> or <literal>&lt;idbag&gt;</literal>.
fr_fr: Remarquez que le mappage d'éléments composites ne supporte pas la nullité des propriétés lorsqu'on utilise un <literal>&lt;set&gt;</literal>. Hibernate lorsqu'il supprime un objet, utilise chaque colonne pour identifier un objet (il n'y a pas de colonne distincte de clés primaires dans la table d'éléments composites), ce qui n'est pas possible avec des valeurs nulles. Vous devez donc choisir d'interdire la nullité des propriétés d'un élément composite ou choisir un autre type de collection comme : <literal>&lt;list&gt;</literal>, <literal>&lt;map&gt;</literal>, <literal>&lt;bag&gt;</literal> ou <literal>&lt;idbag&gt;</literal>.

source: A special case of a composite element is a composite element with a nested <literal>&lt;many-to-one&gt;</literal> element. This mapping allows you to map extra columns of a many-to-many association table to the composite element class. The following is a many-to-many association from <literal>Order</literal> to <literal>Item</literal>, where <literal>purchaseDate</literal>, <literal>price</literal> and <literal>quantity</literal> are properties of the association:
fr_fr: Un cas particulier d'élément composite est un élément composite qui inclut un élément imbriqué <literal>&lt;many-to-one&gt;</literal>. Un mappage comme celui-ci vous permet d'associer des colonnes supplémentaires d'une table d'association plusieurs à plusieurs à la classe de l'élément composite. L'exemple suivant est une association plusieurs à plusieurs de <literal>Order</literal> à <literal>Item</literal> où <literal>purchaseDate</literal>, <literal>price</literal> et <literal>quantity</literal> sont des propriétés de l'association :

source: There cannot be a reference to the purchase on the other side for bidirectional association navigation. Components are value types and do not allow shared references. A single <literal>Purchase</literal> can be in the set of an <literal>Order</literal>, but it cannot be referenced by the <literal>Item</literal> at the same time.
fr_fr: Par ailleurs, on ne peut évidemment pas faire référence à l'achat (purchase), pour pouvoir naviguer de façon bidirectionnelle dans l'association. N'oubliez pas que les composants sont de type valeurs et n'autorisent pas les références partagées. Un <literal>Purchase</literal> unique peut être dans le set d'un <literal>Order</literal>, mais ne peut pas être référencé par <literal>Item</literal> simultanément.

source: Even ternary (or quaternary, etc) associations are possible:
fr_fr: Même les associations ternaires, quaternaires ou autres sont possibles :

source: Composite elements can appear in queries using the same syntax as associations to other entities.
fr_fr: Des éléments composites peuvent apparaître dans les requêtes en utilisant la même syntaxe que les associations vers d'autres entités.

source: Components as Map indices
fr_fr: Les composants en tant qu'indices de Map

source: The <literal>&lt;composite-map-key&gt;</literal> element allows you to map a component class as the key of a <literal>Map</literal>. Ensure that you override <literal>hashCode()</literal> and <literal>equals()</literal> correctly on the component class.
fr_fr: L'élément <literal>&lt;composite-map-key&gt;</literal> vous permet de mapper une classe de composant comme indice d'une <literal>Map</literal>. Assurez-vous de surcharger correctement <literal>hashCode()</literal> et <literal>equals()</literal> dans la classe du composant.

source: Components as composite identifiers
fr_fr: Les composants en tant qu'identifiants composites

source: You can use a component as an identifier of an entity class. Your component class must satisfy certain requirements:
fr_fr: Vous pouvez utiliser un composant comme identifiant d'une classe entité. À cet effet, votre classe de composant doit respecter certaines exigences :

source: It must implement <literal>java.io.Serializable</literal>.
fr_fr: Elle doit implémenter <literal>java.io.Serializable</literal>.

source: It must re-implement <literal>equals()</literal> and <literal>hashCode()</literal> consistently with the database's notion of composite key equality.
fr_fr: Elle doit redéfinir <literal>equals()</literal> et <literal>hashCode()</literal>, de façon cohérente avec la notion d'égalité de clé composite de la base de données.

source: Note
fr_fr: Remarque

source: In Hibernate3, although the second requirement is not an absolutely hard requirement of Hibernate, it is recommended.
fr_fr: Avec Hibernate3, la seconde exigence n'est plus absolument nécessaire, néanmoins continuez de l'effectuer.

source: You cannot use an <literal>IdentifierGenerator</literal> to generate composite keys. Instead the application must assign its own identifiers.
fr_fr: Vous ne pouvez pas utiliser de <literal>IdentifierGenerator</literal> pour générer des clés composites, par contre l'application doit assigner ses propres identifiants.

source: Use the <literal>&lt;composite-id&gt;</literal> tag, with nested <literal>&lt;key-property&gt;</literal> elements, in place of the usual <literal>&lt;id&gt;</literal> declaration. For example, the <literal>OrderLine</literal> class has a primary key that depends upon the (composite) primary key of <literal>Order</literal>.
fr_fr: Utiliser la balise <literal>&lt;composite-id&gt;</literal> (avec les éléments imbriqués <literal>&lt;key-property&gt;</literal>) à la place de l'habituel déclaration <literal>&lt;id&gt;</literal>. Par exemple, la classe <literal>OrderLine</literal> possède une clé primaire qui dépend de la clé primaire (composite) de <literal>Order</literal>.

source: Any foreign keys referencing the <literal>OrderLine</literal> table are now composite. Declare this in your mappings for other classes. An association to <literal>OrderLine</literal> is mapped like this:
fr_fr: Toutes les clés étrangères référençant la table <literal>OrderLine</literal> sont également composites. Vous devez en tenir compte lorsque vous écrivez vos mappage d'association pour les autres classes. Une association à <literal>OrderLine</literal> sera mappée de la façon suivante :

source: A <literal>many-to-many</literal> association to <literal>OrderLine</literal> also uses the composite foreign key:
fr_fr: Une association <literal>plusieurs-à-plusieurs</literal> à <literal>OrderLine</literal> utilisera aussi une clé étrangère composite :

source: The collection of <literal>OrderLine</literal>s in <literal>Order</literal> would use:
fr_fr: La collection des <literal>OrderLine</literal> s dans <literal>Order</literal> utilisera :

source: The <literal>&lt;one-to-many&gt;</literal> element declares no columns.
fr_fr: Comme d'habitude, l'élément <literal>&lt;one-to-many&gt;</literal> ne déclare pas de colonne.

source: If <literal>OrderLine</literal> itself owns a collection, it also has a composite foreign key.
fr_fr: Si <literal>OrderLine</literal> lui-même possède une collection, il possédera de même une clé composite étrangère.

source: Dynamic components
fr_fr: Les composants dynamiques

source: You can also map a property of type <literal>Map</literal>:
fr_fr: Vous pouvez également mapper une propriété de type <literal>Map</literal> :

source: The semantics of a <literal>&lt;dynamic-component&gt;</literal> mapping are identical to <literal>&lt;component&gt;</literal>. The advantage of this kind of mapping is the ability to determine the actual properties of the bean at deployment time just by editing the mapping document. Runtime manipulation of the mapping document is also possible, using a DOM parser. You can also access, and change, Hibernate's configuration-time metamodel via the <literal>Configuration</literal> object.
fr_fr: La sémantique de l'association à un <literal>&lt;dynamic-component&gt;</literal> est identique à celle que l'on utilise pour le <literal>&lt;component&gt;</literal>. L'avantage de ce type de mappage est qu'il permet de déterminer les véritables propriétés du bean au moment du déploiement, en éditant simplement le document de mappage. La manipulation du document de mappage pendant l'exécution de l'application est aussi possible en utilisant un parser DOM. Il y a même mieux, vous pouvez accéder (et changer) le métamodèle de configuration-temps de Hibernate en utilisant l'objet <literal>Configuration</literal>.
