Repository: ControlSystemStudio/cs-studio
Catalog: project/documentation/manual/src/main/docbook/*/content/persistent_classes.po
Languages: fr_fr

source: Persistent Classes
fr_fr: Classes persistantes

source: Persistent classes are classes in an application that implement the entities of the business problem (e.g. Customer and Order in an E-commerce application). Not all instances of a persistent class are considered to be in the persistent state. For example, an instance can instead be transient or detached.
fr_fr: Les classes persistantes sont les classes d'une application qui implémentent les entités d'un problème métier (par ex. Client et Commande dans une application de commerce électronique). Toutes les instances d'une classe persistante ne sont pas forcément dans l'état persistant - en revanche, une instance peut être éphémère (transient) ou détachée.

source: Hibernate works best if these classes follow some simple rules, also known as the Plain Old Java Object (POJO) programming model. However, none of these rules are hard requirements. Indeed, Hibernate3 assumes very little about the nature of your persistent objects. You can express a domain model in other ways (using trees of <literal>Map</literal> instances, for example).
fr_fr: Hibernate fonctionne de manière optimale lorsque ces classes suivent quelques règles simples, aussi connues comme le modèle de programmation Plain Old Java Object (POJO). Cependant, aucune de ces règles ne sont des besoins absolus. En effet, Hibernate3 présuppose très peu de choses à propos de la nature de vos objets persistants. Vous pouvez exprimer un modèle de domaine par d'autres moyens : utiliser des arbres d'instances de <literal>Map</literal>, par exemple.

source: A simple POJO example
fr_fr: Un exemple simple de POJO

source: Most Java applications require a persistent class representing felines. For example:
fr_fr: Toute bonne application Java nécessite une classe persistante représentant les félins. Par exemple :

source: The four main rules of persistent classes are explored in more detail in the following sections.
fr_fr: On explore quatre règles principales de classes persistantes en détail dans les sections qui suivent :

source: Implement a no-argument constructor
fr_fr: Implémenter un constructeur sans argument

source: <literal>Cat</literal> has a no-argument constructor. All persistent classes must have a default constructor (which can be non-public) so that Hibernate can instantiate them using <literal>Constructor.newInstance()</literal>. It is recommended that you have a default constructor with at least <emphasis>package</emphasis> visibility for runtime proxy generation in Hibernate.
fr_fr: <literal>Cat</literal> a un constructeur sans argument. Toutes les classes persistantes doivent avoir un constructeur par défaut (lequel peut ne pas être public) pour que Hibernate puisse les instancier en utilisant <literal>Constructor.newInstance()</literal>. Nous recommandons fortement d'avoir un constructeur par défaut avec au moins une visibilité <emphasis>paquetage</emphasis> pour la génération du proxy à l'exécution dans Hibernate.

source: Provide an identifier property (optional)
fr_fr: Fournir une propriété d'identifiant (optionnel)

source: <literal>Cat</literal> has a property called <literal>id</literal>. This property maps to the primary key column of a database table. The property might have been called anything, and its type might have been any primitive type, any primitive "wrapper" type, <literal>java.lang.String</literal> or <literal>java.util.Date</literal>. If your legacy database table has composite keys, you can use a user-defined class with properties of these types (see the section on composite identifiers later in the chapter.)
fr_fr: <literal>Cat</literal> possède une propriété appelée <literal>id</literal>. Cette propriété mappe la valeur de la colonne de clé primaire de la table d'une base de données. La propriété aurait pu s'appeler autrement, et son type aurait pu être n'importe quel type primitif, n'importe quel "encapsuleur" de type primitif, <literal>java.lang.String</literal> ou <literal>java.util.Date</literal>. (Si votre base de données héritée possède des clés composites, elles peuvent être mappées en utilisant une classe définie par l'utilisateur et possédant les propriétés associées aux types de la clé composite - voir la section concernant les identifiants composites ultérieurement).

source: The identifier property is strictly optional. You can leave them off and let Hibernate keep track of object identifiers internally. We do not recommend this, however.
fr_fr: La propriété d'identifiant est strictement optionnelle. Vous pouvez l'oublier et laisser Hibernate s'occuper des identifiants de l'objet en interne. Toutefois, ce n'est pas recommandé.

source: In fact, some functionality is available only to classes that declare an identifier property:
fr_fr: En fait, quelques fonctionnalités ne sont disponibles que pour les classes déclarant un identifiant de propriété :

source: We recommend that you declare consistently-named identifier properties on persistent classes and that you use a nullable (i.e., non-primitive) type.
fr_fr: Nous recommandons que vous déclariez les propriétés d'identifiant de manière uniforme. Nous recommandons également que vous utilisiez un type nullable (c'est-à-dire non primitif).

source: Prefer non-final classes (optional)
fr_fr: Favoriser les classes non finales (optionnel)

source: A central feature of Hibernate, <emphasis>proxies</emphasis>, depends upon the persistent class being either non-final, or the implementation of an interface that declares all public methods.
fr_fr: Une fonctionnalité clé de Hibernate, les <emphasis>proxies</emphasis>, nécessitent que la classe persistante soit non finale ou qu'elle soit l'implémentation d'une interface qui déclare toutes les méthodes publiques.

source: You can persist <literal>final</literal> classes that do not implement an interface with Hibernate. You will not, however, be able to use proxies for lazy association fetching which will ultimately limit your options for performance tuning.
fr_fr: Vous pouvez persister, grâce à Hibernate, les classes <literal>final</literal> qui n'implémentent pas d'interface, mais vous ne pourrez pas utiliser les proxies pour les chargements d'associations paresseux - ce qui limitera vos possibilités d'ajustement des performances.

source: You should also avoid declaring <literal>public final</literal> methods on the non-final classes. If you want to use a class with a <literal>public final</literal> method, you must explicitly disable proxying by setting <literal>lazy="false"</literal>.
fr_fr: Vous devriez aussi éviter de déclarer des méthodes <literal>public final</literal> sur des classes non-finales. Si vous voulez utiliser une classe avec une méthode <literal>public final</literal>, vous devez explicitement désactiver les proxies en paramétrant <literal>lazy="false"</literal>.

source: Declare accessors and mutators for persistent fields (optional)
fr_fr: Déclarer les accesseurs et mutateurs des attributs persistants (optionnel)

source: <literal>Cat</literal> declares accessor methods for all its persistent fields. Many other ORM tools directly persist instance variables. It is better to provide an indirection between the relational schema and internal data structures of the class. By default, Hibernate persists JavaBeans style properties and recognizes method names of the form <literal>getFoo</literal>, <literal>isFoo</literal> and <literal>setFoo</literal>. If required, you can switch to direct field access for particular properties.
fr_fr: <literal>Cat</literal> déclare des mutateurs pour tous ses champs persistants. Beaucoup d'autres solutions de mappage Objet/relationnel persistent directement les variables d'instance. Nous pensons qu'il est préférable de fournir une indirection entre le schéma relationnel et les structures de données internes de la classe. Par défaut, Hibernate persiste les propriétés suivant le style JavaBean, et reconnaît les noms de méthodes de la forme <literal> getFoo</literal>, <literal>isFoo</literal> et <literal>setFoo</literal>. Vous pouvez changer pour un accès direct aux champs pour des propriétés particulières, si besoin est.

source: Properties need <emphasis>not</emphasis> be declared public - Hibernate can persist a property with a default, <literal>protected</literal> or <literal>private</literal> get / set pair.
fr_fr: Les propriétés <emphasis>n'ont pas</emphasis> à être déclarées publiques - Hibernate peut persister une propriété avec une paire de getter/setter par défault, <literal>protected</literal> ou <literal> private</literal>.

source: Implementing inheritance
fr_fr: Implémenter l'héritage

source: A subclass must also observe the first and second rules. It inherits its identifier property from the superclass, <literal>Cat</literal>. For example:
fr_fr: Une sous-classe doit également suivre la première et la seconde règle. Elle hérite sa propriété d'identifiant de la classe mère <literal>Cat</literal>. Par exemple :

source: Implementing <literal>equals()</literal> and <literal>hashCode()</literal>
fr_fr: Implémenter <literal>equals()</literal> et <literal>hashCode()</literal>

source: You have to override the <literal>equals()</literal> and <literal>hashCode()</literal> methods if you:
fr_fr: Vous devez surcharger les méthodes <literal>equals()</literal> et <literal>hashCode()</literal> si vous :

source: intend to put instances of persistent classes in a <literal>Set</literal> (the recommended way to represent many-valued associations); <emphasis>and</emphasis>
fr_fr: avez l'intention de mettre des instances de classes persistantes dans un <literal>Set</literal> (la manière recommandée pour représenter des associations pluri-valuées); <emphasis>et</emphasis>

source: intend to use reattachment of detached instances
fr_fr: avez l'intention d'utiliser le rattachement d'instances détachées

source: Hibernate guarantees equivalence of persistent identity (database row) and Java identity only inside a particular session scope. When you mix instances retrieved in different sessions, you must implement <literal>equals()</literal> and <literal>hashCode()</literal> if you wish to have meaningful semantics for <literal>Set</literal>s.
fr_fr: Hibernate garantit l'équivalence de l'identité persistante (ligne de base de données) et l'identité Java seulement à l'intérieur de la portée d'une session particulière. Donc dès que nous mélangeons des instances venant de différentes sessions, nous devons implémenter <literal>equals()</literal> et <literal>hashCode()</literal> si nous souhaitons avoir une sémantique correcte pour les <literal>Set</literal> s.

source: The most obvious way is to implement <literal>equals()</literal>/<literal>hashCode()</literal> by comparing the identifier value of both objects. If the value is the same, both must be the same database row, because they are equal. If both are added to a <literal>Set</literal>, you will only have one element in the <literal>Set</literal>). Unfortunately, you cannot use that approach with generated identifiers. Hibernate will only assign identifier values to objects that are persistent; a newly created instance will not have any identifier value. Furthermore, if an instance is unsaved and currently in a <literal>Set</literal>, saving it will assign an identifier value to the object. If <literal>equals()</literal> and <literal>hashCode()</literal> are based on the identifier value, the hash code would change, breaking the contract of the <literal>Set</literal>. See the Hibernate website for a full discussion of this problem. This is not a Hibernate issue, but normal Java semantics of object identity and equality.
fr_fr: La manière la plus évidente est d'implémenter <literal>equals()</literal>/<literal>hashCode()</literal> en comparant la valeur de l'identifiant des deux objets. Si cette valeur est identique, les deux doivent représenter la même ligne de base de données, ils sont donc égaux (si les deux sont ajoutés à un <literal>Set</literal>, nous n'aurons qu'un seul élément dans le <literal>Set</literal>). Malheureusement, nous ne pouvons pas utiliser cette approche avec des identifiants générés ! Hibernate n'assignera de valeur d'identifiant qu'aux objets qui sont persistants, une instance nouvellement créée n'aura donc pas de valeur d'identifiant ! De plus, si une instance est non sauvegardée et actuellement dans un <literal>Set</literal>, le sauvegarder assignera une valeur d'identifiant à l'objet. Si <literal>equals()</literal> et <literal>hashCode()</literal> sont basées sur la valeur de l'identifiant, le code de hachage devrait changer, rompant le contrat du <literal>Set</literal>. Consultez le site web de Hibernate pour des informations plus approfondies. Notez que ceci n'est pas un problème Hibernate, mais concerne la sémantique normale de Java pour l'identité et l'égalité d'un objet.

source: It is recommended that you implement <literal>equals()</literal> and <literal>hashCode()</literal> using <emphasis>Business key equality</emphasis>. Business key equality means that the <literal>equals()</literal> method compares only the properties that form the business key. It is a key that would identify our instance in the real world (a <emphasis>natural</emphasis> candidate key):
fr_fr: Nous recommandons donc d'implémenter <literal>equals()</literal> et <literal>hashCode()</literal> en utilisant <emphasis> l'égalité par clé métier</emphasis>. L'égalité par clé métier signifie que la méthode <literal>equals()</literal> compare uniquement les propriétés qui forment une clé métier, une clé qui identifierait notre instance dans le monde réel (une clé candidate <emphasis>naturelle</emphasis>) :

source: Dynamic models
fr_fr: Modèles dynamiques

source: Note
fr_fr: Remarque

source: Persistent entities do not necessarily have to be represented as POJO classes or as JavaBean objects at runtime. Hibernate also supports dynamic models (using <literal>Map</literal>s of <literal>Map</literal>s at runtime) and the representation of entities as DOM4J trees. With this approach, you do not write persistent classes, only mapping files.
fr_fr: Les entités persistantes ne doivent pas nécessairement être représentées comme des classes POJO ou des objets JavaBean à l'exécution. Hibernate supporte aussi les modèles dynamiques (en utilisant des <literal>Map</literal> s de <literal>Map</literal> s à l'exécution) et la représentation des entités comme des arbres DOM4J. Avec cette approche, vous n'écrivez pas de classes persistantes, seulement des fichiers de mappage.

source: The following examples demonstrate the representation using <literal>Map</literal>s. First, in the mapping file an <literal>entity-name</literal> has to be declared instead of, or in addition to, a class name:
fr_fr: Les exemples suivants démontrent la représentation utilisant des <literal>Map</literal> s. D'abord, dans le fichier de mappage, un <literal>entity-name</literal> doit être déclaré au lieu (ou en plus) d'un nom de classe :

source: Even though associations are declared using target class names, the target type of associations can also be a dynamic entity instead of a POJO.
fr_fr: Notez que même si des associations sont déclarées en utilisant des noms de classe cible, le type de cible d'une association peut aussi être une entité dynamique au lieu d'un POJO.

source: After setting the default entity mode to <literal>dynamic-map</literal> for the <literal>SessionFactory</literal>, you can, at runtime, work with <literal>Map</literal>s of <literal>Map</literal>s:
fr_fr: Après avoir configuré le mode d'entité par défaut à <literal>dynamic-map</literal> pour la <literal>SessionFactory</literal>, nous pouvons lors de l'exécution fonctionner avec des <literal>Map</literal> s de <literal>Map</literal> s :

source: One of the main advantages of dynamic mapping is quick turnaround time for prototyping, without the need for entity class implementation. However, you lose compile-time type checking and will likely deal with many exceptions at runtime. As a result of the Hibernate mapping, the database schema can easily be normalized and sound, allowing to add a proper domain model implementation on top later on.
fr_fr: Les avantages d'un mappage dynamique sont un gain de temps pour le prototypage sans la nécessité d'implémenter les classes d'entité. Pourtant, vous perdez la vérification du typage au moment de la compilation et aurez plus d'exceptions à gérer lors de l'exécution. Grâce au mappage de Hibernate, le schéma de la base de données peut facilement être normalisé et solidifié, permettant de rajouter une implémentation propre du modèle de domaine plus tard.

source: Entity representation modes can also be set on a per <literal>Session</literal> basis:
fr_fr: Les modes de représentation d'une entité peuvent aussi être configurés en se basant sur <literal>Session</literal> :

source: Please note that the call to <literal>getSession()</literal> using an <literal>EntityMode</literal> is on the <literal>Session</literal> API, not the <literal>SessionFactory</literal>. That way, the new <literal>Session</literal> shares the underlying JDBC connection, transaction, and other context information. This means you do not have to call <literal>flush()</literal> and <literal>close()</literal> on the secondary <literal>Session</literal>, and also leave the transaction and connection handling to the primary unit of work.
fr_fr: Veuillez noter que l'appel à <literal>getSession()</literal> en utilisant un <literal>EntityMode</literal> se fait sur l'API <literal>Session</literal>, et non sur <literal>SessionFactory</literal>. De cette manière, la nouvelle <literal>Session</literal> partage les connexions JDBC, transactions et autres informations de contexte sous-jacentes. Cela signifie que vous n'avez pas à appeler <literal>flush()</literal> et <literal>close()</literal> sur la <literal>Session</literal> secondaire, et laissez aussi la gestion de la transaction et de la connexion à l'unité de travail primaire.

source: <literal>org.hibernate.tuple.Tuplizer</literal>, and its sub-interfaces, are responsible for managing a particular representation of a piece of data given that representation's <literal>org.hibernate.EntityMode</literal>. If a given piece of data is thought of as a data structure, then a tuplizer is the thing that knows how to create such a data structure and how to extract values from and inject values into such a data structure. For example, for the POJO entity mode, the corresponding tuplizer knows how create the POJO through its constructor. It also knows how to access the POJO properties using the defined property accessors.
fr_fr: <literal>org.hibernate.tuple.Tuplizer</literal>, et ses sous-interfaces, sont responsables de la gestion d'une représentation particulière d'un fragment de données, en fonction du <literal>org.hibernate.EntityMode</literal> de représentation. Si un fragment donné de données est considéré comme une structure de données, alors un tuplizer sait comment créer une telle structure de données, comment extraire des valeurs et injecter des valeurs dans une telle structure de données. Par exemple, pour le mode d'entité POJO, le tuplizer correspondant sait comment créer le POJO à travers son constructeur et comment accéder aux propriétés du POJO utilisant les accesseurs de la propriété définie.

source: There are two high-level types of Tuplizers, represented by the <literal>org.hibernate.tuple.entity.EntityTuplizer</literal> and <literal>org.hibernate.tuple.component.ComponentTuplizer</literal> interfaces. <literal>EntityTuplizer</literal>s are responsible for managing the above mentioned contracts in regards to entities, while <literal>ComponentTuplizer</literal>s do the same for components.
fr_fr: Il y a deux types de Tuplizers de haut niveau, représentés par les interfaces <literal>org.hibernate.tuple.EntityTuplizer</literal> et <literal>org.hibernate.tuple.ComponentTuplizer</literal>. Les <literal>EntityTuplizer</literal> s sont responsables de la gestion des contrats mentionnés ci-dessus pour les entités, alors que les <literal>ComponentTuplizer</literal> s s'occupent des composants.

source: Users can also plug in their own tuplizers. Perhaps you require that a <literal>java.util.Map</literal> implementation other than <literal>java.util.HashMap</literal> be used while in the dynamic-map entity-mode. Or perhaps you need to define a different proxy generation strategy than the one used by default. Both would be achieved by defining a custom tuplizer implementation. Tuplizer definitions are attached to the entity or component mapping they are meant to manage. Going back to the example of our customer entity:
fr_fr: Les utilisateurs peuvent aussi brancher leurs propres tuplizers. Il vous faudra peut-être utiliser une implémentation de <literal>java.util.Map</literal> autre que <literal>java.util.HashMap</literal> dans le mode d'entité dynamic-map ; ou peut-être aurez vous besoin de définir une stratégie de génération de proxy différente de celle utilisée par défaut. Les deux devraient être effectuées en définissant une implémentation de tuplizer utilisateur. Les définitions de tuplizers sont attachées au mappage de l'entité ou du composant qu'ils devraient gérer. Revenons à l'exemple de notre entité utilisateur :

source: The <interfacename>org.hibernate.EntityNameResolver</interfacename> interface is a contract for resolving the entity name of a given entity instance. The interface defines a single method <methodname>resolveEntityName</methodname> which is passed the entity instance and is expected to return the appropriate entity name (null is allowed and would indicate that the resolver does not know how to resolve the entity name of the given entity instance). Generally speaking, an <interfacename>org.hibernate.EntityNameResolver</interfacename> is going to be most useful in the case of dynamic models. One example might be using proxied interfaces as your domain model. The hibernate test suite has an example of this exact style of usage under the <package>org.hibernate.test.dynamicentity.tuplizer2</package>. Here is some of the code from that package for illustration.
fr_fr: L'interface <interfacename>org.hibernate.EntityNameResolver</interfacename> représente un contrat pour résoudre le nom de l'entité d'une instance d'entité donnée. L'interface définit une méthode simple <methodname>resolveEntityName</methodname>, à qui l'on passe l'instance d'entité et qui doit retourner le nom d'entité qui convient (null est accepté et indiquerait que le resolver ne sait pas comment résoudre le nom de l'entité de l'instance d'entité donnée). Normalement, un <interfacename>org.hibernate.EntityNameResolver</interfacename> est surtout utile pour les modèles dynamiques. Vous pourriez, par exemple, utiliser des interfaces proxy comme modèle de domaine. La suite de test Hibernate comprend un exemple de ce style précis d'utilisation dans <package>org.hibernate.test.dynamicentity.tuplizer2</package>. Vous trouverez ci dessous une illustration du code de ce package.

source: In order to register an <interfacename>org.hibernate.EntityNameResolver</interfacename> users must either:
fr_fr: Pour enregistrer un <interfacename>org.hibernate.EntityNameResolver</interfacename>, les utilisateurs doivent soit :
