Repository: ControlSystemStudio/cs-studio
Catalog: project/documentation/manual/src/main/docbook/*/content/persistent_classes.po
Languages: fr_fr

source: Register it with the <classname>org.hibernate.impl.SessionFactoryImpl</classname> (which is the implementation class for <interfacename>org.hibernate.SessionFactory</interfacename>) using the <methodname>registerEntityNameResolver</methodname> method.
fr_fr: L'enregistrer dans <classname>org.hibernate.impl.SessionFactoryImpl</classname> (qui est la classe d'implémentation de <interfacename>org.hibernate.SessionFactory</interfacename>) à l'aide de la méthode <methodname>registerEntityNameResolver</methodname>.
