Repository: ControlSystemStudio/cs-studio
Catalog: project/documentation/manual/src/main/docbook/*/content/query_hql.po
Languages: fr_fr

source: <literal>coalesce()</literal> and <literal>nullif()</literal>
fr_fr: <literal>coalesce()</literal> et <literal>nullif()</literal>

source: <literal>str()</literal> for converting numeric or temporal values to a readable string
fr_fr: <literal>str()</literal> pour convertir des valeurs numériques ou temporelles vers une chaîne de caractères lisible

source: <literal>cast(... as ...)</literal>, where the second argument is the name of a Hibernate type, and <literal>extract(... from ...)</literal> if ANSI <literal>cast()</literal> and <literal>extract()</literal> is supported by the underlying database
fr_fr: <literal>cast(... as ...)</literal>, où le second argument est le nom d'un type Hibernate, et <literal>extract(... from ...)</literal> si le <literal>cast()</literal> ANSI et <literal>extract()</literal> sont supportés par la base de données sous-jacente

source: the HQL <literal>index()</literal> function, that applies to aliases of a joined indexed collection
fr_fr: La fonction HQL <literal>index()</literal>, qui s'applique aux alias d'une collection indexée jointe

source: HQL functions that take collection-valued path expressions: <literal>size(), minelement(), maxelement(), minindex(), maxindex()</literal>, along with the special <literal>elements()</literal> and <literal>indices</literal> functions that can be quantified using <literal>some, all, exists, any, in</literal>.
fr_fr: Les fonctions HQL qui prennent des expressions de chemin représentant des collections : <literal>size(), minelement(), maxelement(), minindex(), maxindex()</literal>, ainsi que les fonctions particulières <literal>elements()</literal> et <literal>indices</literal> qui peuvent être quantifiées en utilisant <literal>some, all, exists, any, in</literal>.

source: Any database-supported SQL scalar function like <literal>sign()</literal>, <literal>trunc()</literal>, <literal>rtrim()</literal>, and <literal>sin()</literal>
fr_fr: N'importe quelle fonction scalaire SQL supportée par la base de données comme <literal>sign()</literal>, <literal>trunc()</literal>, <literal>rtrim()</literal>, et <literal>sin()</literal>

source: JDBC-style positional parameters <literal>?</literal>
fr_fr: Les paramètres de position de JDBC <literal>?</literal>

source: named parameters <literal>:name</literal>, <literal>:start_date</literal>, and <literal>:x1</literal>
fr_fr: paramètres nommés <literal>:name</literal>, <literal>:start_date</literal>, et <literal>:x1</literal>

source: SQL literals <literal>'foo'</literal>, <literal>69</literal>, <literal>6.66E+2</literal>, <literal>'1970-01-01 10:00:01.0'</literal>
fr_fr: SQL textuel <literal>'foo'</literal>, <literal>69</literal>, <literal>6.66E+2</literal>, <literal>'1970-01-01 10:00:01.0'</literal>

source: Java <literal>public static final</literal> constants <literal>eg.Color.TABBY</literal>
fr_fr: Constantes Java <literal>public static final</literal><literal>eg.Color.TABBY</literal>

source: <literal>in</literal> and <literal>between</literal> can be used as follows:
fr_fr: <literal>in</literal> et <literal>between</literal> peuvent être utilisés comme suit :

source: The negated forms can be written as follows:
fr_fr: Les formes négatives peuvent être écrites ainsi :

source: Similarly, <literal>is null</literal> and <literal>is not null</literal> can be used to test for null values.
fr_fr: De même, <literal>is null</literal> et <literal>is not null</literal> peuvent être utilisés pour tester les valeurs nulles.

source: Booleans can be easily used in expressions by declaring HQL query substitutions in Hibernate configuration:
fr_fr: Les booléens peuvent être facilement utilisés en déclarant les substitutions de requêtes HQL dans la configuration Hibernate :

source: This will replace the keywords <literal>true</literal> and <literal>false</literal> with the literals <literal>1</literal> and <literal>0</literal> in the translated SQL from this HQL:
fr_fr: Ce qui remplacera les mots clés <literal>true</literal> et <literal>false</literal> par <literal>1</literal> et <literal>0</literal> dans la traduction SQL du HQL suivant :

source: You can test the size of a collection with the special property <literal>size</literal> or the special <literal>size()</literal> function.
fr_fr: Vous pouvez tester la taille d'une collection par la propriété particulière <literal>size</literal>, ou la fonction spéciale <literal>size()</literal>.

source: For indexed collections, you can refer to the minimum and maximum indices using <literal>minindex</literal> and <literal>maxindex</literal> functions. Similarly, you can refer to the minimum and maximum elements of a collection of basic type using the <literal>minelement</literal> and <literal>maxelement</literal> functions. For example:
fr_fr: Pour les collections indexées, vous pouvez faire référence aux indices minimum et maximum en utilisant les fonctions <literal>minindex</literal> et <literal>maxindex</literal>. De manière similaire, vous pouvez faire référence aux éléments minimum et maximum d'une collection de type basique en utilisant les fonctions <literal>minelement</literal> et <literal>maxelement</literal>. Par exemple :

source: The SQL functions <literal>any, some, all, exists, in</literal> are supported when passed the element or index set of a collection (<literal>elements</literal> and <literal>indices</literal> functions) or the result of a subquery (see below):
fr_fr: Les fonctions SQL <literal>any, some, all, exists, in</literal> sont supportées quand l'élément ou l'ensemble des indexes d'une collection (les fonctions <literal>elements</literal> et <literal>indices</literal>) ou le résultat d'une sous requête sont passés (voir ci dessous) :

source: Note that these constructs - <literal>size</literal>, <literal>elements</literal>, <literal>indices</literal>, <literal>minindex</literal>, <literal>maxindex</literal>, <literal>minelement</literal>, <literal>maxelement</literal> - can only be used in the where clause in Hibernate3.
fr_fr: Notez que l'écriture de - <literal>size</literal>, <literal>elements</literal>, <literal>indices</literal>, <literal>minindex</literal>, <literal>maxindex</literal>, <literal>minelement</literal>, <literal>maxelement</literal> - peut seulement être utilisée dans la clause where dans Hibernate3.

source: Elements of indexed collections (arrays, lists, and maps) can be referred to by index in a where clause only:
fr_fr: Les éléments de collections indexées (arrays, lists, maps) peuvent être référencés via index dans une clause where seulement :

source: The expression inside <literal>[]</literal> can even be an arithmetic expression:
fr_fr: L'expression entre <literal>[]</literal> peut même être une expression arithmétique :

source: HQL also provides the built-in <literal>index()</literal> function for elements of a one-to-many association or collection of values.
fr_fr: HQL propose aussi une fonction <literal>index()</literal> interne, pour les éléments d'une association un-à-plusieurs ou d'une collection de valeurs.

source: Scalar SQL functions supported by the underlying database can be used:
fr_fr: Les fonctions SQL scalaires supportées par la base de données utilisée peuvent être utilisées :

source: Consider how much longer and less readable the following query would be in SQL:
fr_fr: Si vous n'êtes pas encore convaincu par tout cela, imaginez la taille et l'illisibilité qui caractériseraient la requête suivante en SQL :

source: <emphasis>Hint:</emphasis> something like
fr_fr: <emphasis>Un indice :</emphasis> cela donne quelque chose comme

source: The order by clause
fr_fr: La clause order by

source: The list returned by a query can be ordered by any property of a returned class or components:
fr_fr: La liste retournée par la requête peut être triée par n'importe quelle propriété de la classe ou des composants retournés :

source: The optional <literal>asc</literal> or <literal>desc</literal> indicate ascending or descending order respectively.
fr_fr: Le mot optionnel <literal>asc</literal> ou <literal>desc</literal> indique respectivement si le tri doit être croissant ou décroissant.

source: The group by clause
fr_fr: La clause group by

source: A query that returns aggregate values can be grouped by any property of a returned class or components:
fr_fr: Si la requête retourne des valeurs agrégées, celles-ci peuvent être groupées par propriété d'une classe retournée ou par des composants :

source: A <literal>having</literal> clause is also allowed.
fr_fr: Une clause <literal>having</literal> est aussi permise.

source: SQL functions and aggregate functions are allowed in the <literal>having</literal> and <literal>order by</literal> clauses if they are supported by the underlying database (i.e., not in MySQL).
fr_fr: Les fonctions SQL et les fonctions d'agrégat sont permises dans les clauses <literal>having</literal> et <literal>order by</literal>, si elles sont prises en charge par la base de données sous-jacente (ce que ne fait pas MySQL par exemple).

source: Neither the <literal>group by</literal> clause nor the <literal>order by</literal> clause can contain arithmetic expressions. Hibernate also does not currently expand a grouped entity, so you cannot write <literal>group by cat</literal> if all properties of <literal>cat</literal> are non-aggregated. You have to list all non-aggregated properties explicitly.
fr_fr: Notez que ni la clause <literal>group by</literal> ni la clause <literal>order by</literal> ne peuvent contenir d'expressions arithmétiques. Notez aussi qu'Hibernate ne développe pas actuellement une entité faisant partie du regroupement, donc vous ne pouvez pas écrire <literal>group by cat</literal> si toutes les propriétés de <literal>cat</literal> sont non-agrégées. Vous devez lister toutes les propriétés non-agrégées explicitement.

source: Subqueries
fr_fr: Sous-requêtes

source: For databases that support subselects, Hibernate supports subqueries within queries. A subquery must be surrounded by parentheses (often by an SQL aggregate function call). Even correlated subqueries (subqueries that refer to an alias in the outer query) are allowed.
fr_fr: Pour les bases de données supportant les sous-selects, Hibernate supporte les sous requêtes dans les requêtes. Une sous-requête doit être entre parenthèses (souvent pour un appel à une fonction d'agrégation SQL). Même les sous-requêtes corrélées (celles qui font référence à un alias de la requête principale) sont supportées.

source: Note that HQL subqueries can occur only in the select or where clauses.
fr_fr: Notez que les sous-requêtes HQL peuvent survenir uniquement dans les clauses select ou where.

source: HQL examples
fr_fr: Exemples HQL

source: Hibernate queries can be quite powerful and complex. In fact, the power of the query language is one of Hibernate's main strengths. The following example queries are similar to queries that have been used on recent projects. Please note that most queries you will write will be much simpler than the following examples.
fr_fr: Les requêtes Hibernate peuvent être relativement puissantes et complexes. En fait, la puissance du langage d'interrogation est l'un des arguments principaux de vente de Hibernate. Voici quelques exemples très similaires aux requêtes que nous avons utilisées lors d'un récent projet. Notez que la plupart des requêtes que vous écrirez seront plus simples que les exemples qui suivent.

source: The following query returns the order id, number of items, the given minimum total value and the total value of the order for all unpaid orders for a particular customer. The results are ordered by total value. In determining the prices, it uses the current catalog. The resulting SQL query, against the <literal>ORDER</literal>, <literal>ORDER_LINE</literal>, <literal>PRODUCT</literal>, <literal>CATALOG</literal> and <literal>PRICE</literal> tables has four inner joins and an (uncorrelated) subselect.
fr_fr: La requête suivante retourne l'id de commande, le nombre d'articles et la valeur totale de la commande pour toutes les commandes non payées d'un client particulier pour une valeur totale minimum donnée, ces résultats étant triés par la valeur totale. La requête SQL générée sur les tables <literal>ORDER</literal>, <literal>ORDER_LINE</literal>, <literal>PRODUCT</literal>, <literal>CATALOG</literal> et <literal>PRICE</literal> est composée de quatre jointures internes ainsi que d'un sous-select (non corrélé).

source: What a monster! Actually, in real life, I'm not very keen on subqueries, so my query was really more like this:
fr_fr: Quel monstre ! En principe, dans des situations réelles, nous n'approuvons pas les sous-requêtes, notre requête ressemblait donc plutôt à ce qui suit :

source: The next query counts the number of payments in each status, excluding all payments in the <literal>AWAITING_APPROVAL</literal> status where the most recent status change was made by the current user. It translates to an SQL query with two inner joins and a correlated subselect against the <literal>PAYMENT</literal>, <literal>PAYMENT_STATUS</literal> and <literal>PAYMENT_STATUS_CHANGE</literal> tables.
fr_fr: La requête suivante compte le nombre de paiements pour chaque statut, en excluant tout paiement dans le statut <literal>AWAITING_APPROVAL</literal> où le changement de statut le plus récent à été fait par l'utilisateur courant. En SQL, cette requête effectue deux jointures internes et un sous-select corrélé sur les tables <literal>PAYMENT</literal>, <literal>PAYMENT_STATUS</literal> et <literal>PAYMENT_STATUS_CHANGE</literal>.

source: If the <literal>statusChanges</literal> collection was mapped as a list, instead of a set, the query would have been much simpler to write.
fr_fr: Si nous avions mappé la collection <literal>statusChanges</literal> comme une liste, au lieu d'un ensemble, la requête aurait été plus facile à écrire.

source: The next query uses the MS SQL Server <literal>isNull()</literal> function to return all the accounts and unpaid payments for the organization to which the current user belongs. It translates to an SQL query with three inner joins, an outer join and a subselect against the <literal>ACCOUNT</literal>, <literal>PAYMENT</literal>, <literal>PAYMENT_STATUS</literal>, <literal>ACCOUNT_TYPE</literal>, <literal>ORGANIZATION</literal> and <literal>ORG_USER</literal> tables.
fr_fr: La prochaine requête utilise la fonction de serveur MS SQL <literal>isNull()</literal> pour retourner tous les comptes et paiements impayés pour l'organisation à laquelle l'utilisateur courant appartient. Elle est traduite en SQL par trois jointures internes, une jointure externe ainsi qu'un sous-select sur les tables <literal>ACCOUNT</literal>, <literal>PAYMENT</literal>, <literal>PAYMENT_STATUS</literal>, <literal>ACCOUNT_TYPE</literal>, <literal>ORGANIZATION</literal> et <literal>ORG_USER</literal>.

source: For some databases, we would need to do away with the (correlated) subselect.
fr_fr: Pour certaines bases de données, nous devons éliminer le sous-select (corrélé).

source: Bulk update and delete
fr_fr: Nombreuses mises à jour et suppressions

source: Tips &amp; Tricks
fr_fr: Trucs &amp; Astuces

source: You can count the number of query results without returning them:
fr_fr: Vous pouvez compter le nombre de résultats d'une requête sans les retourner :

source: To order a result by the size of a collection, use the following query:
fr_fr: Pour trier les résultats par la taille d'une collection, utilisez la requête suivante :

source: If your database supports subselects, you can place a condition upon selection size in the where clause of your query:
fr_fr: Si votre base de données supporte les sous-selects, vous pouvez placer des conditions sur la taille de la sélection dans la clause where de votre requête :

source: If your database does not support subselects, use the following query:
fr_fr: Si votre base de données ne supporte pas les sous-selects, utilisez la requête suivante :

source: As this solution cannot return a <literal>User</literal> with zero messages because of the inner join, the following form is also useful:
fr_fr: Cette solution ne peut pas retourner un <literal>User</literal> avec zéro message à cause de la jointure interne, la forme suivante peut donc être utile :

source: Properties of a JavaBean can be bound to named query parameters:
fr_fr: Les propriétés d'un JavaBean peuvent être injectées dans les paramètres nommés d'une requête :

source: Collections are pageable by using the <literal>Query</literal> interface with a filter:
fr_fr: Les collections sont paginables via l'utilisation de l'interface <literal>Query</literal> avec un filtre :

source: Collection elements can be ordered or grouped using a query filter:
fr_fr: Les éléments d'une collection peuvent être triés ou groupés en utilisant un filtre de requête :

source: You can find the size of a collection without initializing it:
fr_fr: Vous pouvez récupérer la taille d'une collection sans l'initialiser :

source: Components
fr_fr: Composants

source: Components can be used similarly to the simple value types that are used in HQL queries. They can appear in the <literal>select</literal> clause as follows:
fr_fr: Les composants peuvent être utilisés dans presque tous les cas comme les types de valeur dans les requêtes HQL. Ils peuvent apparaître dans la clause <literal>select</literal> comme ce qui suit :

source: where the Person's name property is a component. Components can also be used in the <literal>where</literal> clause:
fr_fr: où la propriété de nom de Person est un composant. Des composants peuvent aussi être utilisés dans la clause <literal>where</literal> :

source: Components can also be used in the <literal>order by</literal> clause:
fr_fr: Des composants peuvent être utilisés dans la clause <literal>order by</literal> :

source: Row value constructor syntax
fr_fr: Syntaxe des constructeurs de valeur de ligne

source: HQL supports the use of ANSI SQL <literal>row value constructor</literal> syntax, sometimes referred to AS <literal>tuple</literal> syntax, even though the underlying database may not support that notion. Here, we are generally referring to multi-valued comparisons, typically associated with components. Consider an entity Person which defines a name component:
fr_fr: HQL supporte l'utilisation de la syntaxe <literal>row value constructor</literal> SQL ANSI (aussi appelée syntaxe <literal>tuple</literal>), bien que la base de données sous-jacente ne supporte pas nécessairement cette notion. Là, nous faisons généralement référence à des comparaisons multi-valuées, typiquement associées à des composants. Considérez une entité Person qui définit un composant de nom :

source: That is valid syntax although it is a little verbose. You can make this more concise by using <literal>row value constructor</literal> syntax:
fr_fr: Voici une syntaxe valide, bien que quelque peu fastidieuse. Pour la rendre plus concise, utilisez la syntaxe <literal>row value constructor</literal> :

source: It can also be useful to specify this in the <literal>select</literal> clause:
fr_fr: Il est utile de spécifier cela dans la clause <literal>select</literal> :

source: Using <literal>row value constructor</literal> syntax can also be beneficial when using subqueries that need to compare against multiple values:
fr_fr: Alternativement, utiliser la syntaxe <literal>row value constructor</literal> peut être avantageux quand vous utilisez des sous-requêtes nécessitant une comparaison avec des valeurs multiples :

source: One thing to consider when deciding if you want to use this syntax, is that the query will be dependent upon the ordering of the component sub-properties in the metadata.
fr_fr: Si vous décidez d'utiliser cette syntaxe, il vous faudra prendre en considération le fait que la requête sera dépendante de la commande des sous-propriétés du composant dans les métadonnées.
