Repository: ControlSystemStudio/cs-studio
Catalog: project/documentation/manual/src/main/docbook/*/content/query_hql.po
Languages: fr_fr

source: HQL: The Hibernate Query Language
fr_fr: HQL : langage d'interrogation d'Hibernate

source: Hibernate uses a powerful query language (HQL) that is similar in appearance to SQL. Compared with SQL, however, HQL is fully object-oriented and understands notions like inheritance, polymorphism and association.
fr_fr: Hibernate fournit un langage d'interrogation extrêmement puissant qui ressemble (et c'est voulu) au SQL. Mais ne soyez pas dupe de la syntaxe ; HQL est totalement orienté objet, cernant des notions comme l'héritage, le polymorphisme et les associations.

source: Case Sensitivity
fr_fr: Sensibilité à la casse

source: With the exception of names of Java classes and properties, queries are case-insensitive. So <literal>SeLeCT</literal> is the same as <literal>sELEct</literal> is the same as <literal>SELECT</literal>, but <literal>org.hibernate.eg.FOO</literal> is not <literal>org.hibernate.eg.Foo</literal>, and <literal>foo.barSet</literal> is not <literal>foo.BARSET</literal>.
fr_fr: Les requêtes sont insensibles à la casse, à l'exception des noms de classes Java et des propriétés. Ainsi, <literal>SeLeCT</literal> est identique à <literal>sELEct</literal> et à <literal>SELECT</literal> mais <literal>net.sf.hibernate.eg.FOO</literal> n'est pas identique <literal>net.sf.hibernate.eg.Foo</literal> et <literal>foo.barSet</literal> n'est pas identique à <literal>foo.BARSET</literal>.

source: This manual uses lowercase HQL keywords. Some users find queries with uppercase keywords more readable, but this convention is unsuitable for queries embedded in Java code.
fr_fr: Ce guide utilise les mots clés HQL en minuscules. Certains utilisateurs trouvent les requêtes écrites avec les mots clés en majuscules plus lisibles, mais nous trouvons cette convention pénible lorsqu'elle est lue dans du code Java.

source: The from clause
fr_fr: La clause from

source: The simplest possible Hibernate query is of the form:
fr_fr: La requête Hibernate la plus simple est de la forme :

source: This returns all instances of the class <literal>eg.Cat</literal>. You do not usually need to qualify the class name, since <literal>auto-import</literal> is the default. For example:
fr_fr: Retourne toutes les instances de la classe <literal>eg.Cat</literal>. Nous n'avons pas besoin de qualifier le nom de la classe, puisque <literal>auto-import</literal> est la valeur par défaut. Donc nous écrivons presque toujours :

source: In order to refer to the <literal>Cat</literal> in other parts of the query, you will need to assign an <emphasis>alias</emphasis>. For example:
fr_fr: Pour pouvoir nous référer à <literal>Cat</literal> dans des autres parties de la requête, vous aurez besoin d'y assigner un <emphasis>alias</emphasis>. Ainsi :

source: This query assigns the alias <literal>cat</literal> to <literal>Cat</literal> instances, so you can use that alias later in the query. The <literal>as</literal> keyword is optional. You could also write:
fr_fr: Cette requête assigne l'alias <literal>cat</literal> à l'instance <literal>Cat</literal>, nous pouvons donc utiliser cet alias ailleurs dans la requête. Le mot clé <literal>as</literal> est optionnel. Nous aurions pu écrire :

source: Multiple classes can appear, resulting in a cartesian product or "cross" join.
fr_fr: Plusieurs classes peuvent apparaître, ce qui conduira à un produit cartésien (encore appelé jointures croisées).

source: It is good practice to name query aliases using an initial lowercase as this is consistent with Java naming standards for local variables (e.g. <literal>domesticCat</literal>).
fr_fr: C'est une bonne pratique que de nommer les alias dans les requêtes en utilisant l'initiale en miniscule, ce qui correspond aux standards de nommage Java pour les variables locales (par ex. <literal>domesticCat</literal>).

source: Associations and joins
fr_fr: Associations et jointures

source: You can also assign aliases to associated entities or to elements of a collection of values using a <literal>join</literal>. For example:
fr_fr: On peut aussi assigner des alias à des entités associées, ou même aux éléments d'une collection de valeurs, en utilisant un <literal>join</literal> (jointure). Par exemple :

source: The supported join types are borrowed from ANSI SQL:
fr_fr: Les types de jointures supportées sont empruntées de ANSI SQL :

source: <literal>inner join</literal>
fr_fr: <literal>inner join</literal> (jointure interne)

source: <literal>full join</literal> (not usually useful)
fr_fr: <literal>full join</literal> (jointure ouverte totalement - généralement inutile)

source: The <literal>inner join</literal>, <literal>left outer join</literal> and <literal>right outer join</literal> constructs may be abbreviated.
fr_fr: Les constructions des jointures <literal>inner join</literal>, <literal>left outer join</literal> et <literal>right outer join</literal> peuvent être abrégées.

source: You may supply extra join conditions using the HQL <literal>with</literal> keyword.
fr_fr: Nous pouvons soumettre des conditions de jointure supplémentaires en utilisant le mot-clef HQL <literal>with</literal>.

source: A fetch join does not usually need to assign an alias, because the associated objects should not be used in the <literal>where</literal> clause (or any other clause). The associated objects are also not returned directly in the query results. Instead, they may be accessed via the parent object. The only reason you might need an alias is if you are recursively join fetching a further collection:
fr_fr: Une jointure "fetch" (rapportée) n'a généralement pas besoin de se voir assigner un alias puisque les objets associés ne doivent pas être utilisés dans la clause <literal>where</literal> ou toute autre clause. Notez aussi que les objets associés ne sont pas retournés directement dans le résultat de la requête mais l'on peut y accéder via l'objet parent. La seule raison pour laquelle nous pourrions avoir besoin d'un alias est si nous récupérons récursivement une collection supplémentaire :

source: The <literal>fetch</literal> construct cannot be used in queries called using <literal>iterate()</literal> (though <literal>scroll()</literal> can be used). <literal>Fetch</literal> should be used together with <literal>setMaxResults()</literal> or <literal>setFirstResult()</literal>, as these operations are based on the result rows which usually contain duplicates for eager collection fetching, hence, the number of rows is not what you would expect. <literal>Fetch</literal> should also not be used together with impromptu <literal>with</literal> condition. It is possible to create a cartesian product by join fetching more than one collection in a query, so take care in this case. Join fetching multiple collection roles can produce unexpected results for bag mappings, so user discretion is advised when formulating queries in this case. Finally, note that <literal>full join fetch</literal> and <literal>right join fetch</literal> are not meaningful.
fr_fr: Notez que la construction de <literal>fetch</literal> ne peut pas être utilisée dans les requêtes appelées par <literal>scroll()</literal> ou <literal>iterate()</literal>. De même <literal>Fetch</literal> ne devrait pas être utilisé avec <literal>setMaxResults()</literal> ou <literal>setFirstResult()</literal>, ces opérations étant basées sur le nombre de résultats contenant généralement des doublons dès que des collections sont chargées agressivement, par conséquent le nombre de lignes est imprévisible. <literal>Fetch</literal> ne peut pas non plus être utilisé avec une condition <literal>with</literal> ad hoc. Il est possible de créer un produit cartésien par jointure en récupérant plus d'une collection dans une requête, donc faites attention dans ce cas. Récupérer par jointure de multiples collections donne aussi parfois des résultats inattendus pour des mappages de sac, donc soyez prudent lorsque vous formulez vos requêtes dans de tels cas. Finalement, notez que <literal>full join fetch</literal> et <literal>right join fetch</literal> ne sont pas utiles en général.

source: If you are using property-level lazy fetching (with bytecode instrumentation), it is possible to force Hibernate to fetch the lazy properties in the first query immediately using <literal>fetch all properties</literal>.
fr_fr: Si vous utilisez un chargement retardé pour les propriétés (avec une instrumentation par bytecode), il est possible de forcer Hibernate à récupérer les propriétés non encore chargées immédiatement (dans la première requête) en utilisant <literal>fetch all properties</literal>.

source: Forms of join syntax
fr_fr: Formes de syntaxes pour les jointures

source: HQL supports two forms of association joining: <literal>implicit</literal> and <literal>explicit</literal>.
fr_fr: HQL supporte deux formes pour joindre les associations : <literal>implicit</literal> et <literal>explicit</literal>.

source: The queries shown in the previous section all use the <literal>explicit</literal> form, that is, where the join keyword is explicitly used in the from clause. This is the recommended form.
fr_fr: Les requêtes présentes dans la section précédente utilisent la forme <literal>explicit</literal> où le mot clé join est explicitement utilisé dans la clause from. C'est la forme recommandée.

source: The <literal>implicit</literal> form does not use the join keyword. Instead, the associations are "dereferenced" using dot-notation. <literal>implicit</literal> joins can appear in any of the HQL clauses. <literal>implicit</literal> join result in inner joins in the resulting SQL statement.
fr_fr: La forme <literal>implicit</literal> n'utilise pas le mot clé join. En revanche, les associations sont "déréférencées" en utilisant la notation. Ces jointures <literal>implicit</literal> peuvent apparaître dans toutes les clauses HQL. Les jointures <literal>implicit</literal> résultent en des jointures internes dans le SQL généré.

source: Referring to identifier property
fr_fr: Faire référence à la propriété identifiant

source: There are 2 ways to refer to an entity's identifier property:
fr_fr: Il y a en général deux façons de faire référence à une propriété d'identifiant d'une entité :

source: The special property (lowercase) <literal>id</literal> may be used to reference the identifier property of an entity <emphasis>provided that the entity does not define a non-identifier property named id</emphasis>.
fr_fr: La propriété particulière (minuscule) <literal>id</literal> peut être utilisée pour référencer la propriété d'identifiant d'une entité <emphasis>du moment que l'entité ne définisse pas une propriété de non-identifiant appelée id</emphasis>.

source: If the entity defines a named identifier property, you can use that property name.
fr_fr: Si l'identité définit une propriété d'identifiant nommée, vous pouvez utiliser ce nom de propriété.

source: References to composite identifier properties follow the same naming rules. If the entity has a non-identifier property named id, the composite identifier property can only be referenced by its defined named. Otherwise, the special <literal>id</literal> property can be used to reference the identifier property.
fr_fr: Les références aux propriétés d'identifiant composites suivent les mêmes règles de nommage. Si l'entité a une propriété de non-identifiant appelée id, la propriété d'identifiant composite ne peut être référencée que par son nom défini ; sinon la propriété spéciale <literal>id</literal> peut être utilisée pour référencer la propriété d'identifiant.

source: Please note that, starting in version 3.2.2, this has changed significantly. In previous versions, <literal>id</literal> <emphasis>always</emphasis> referred to the identifier property regardless of its actual name. A ramification of that decision was that non-identifier properties named <literal>id</literal> could never be referenced in Hibernate queries.
fr_fr: Note : cela a changé de façon significative depuis la version 3.2.2. Dans les versions précédentes, <literal>id</literal> référait <emphasis>toujours</emphasis> à la propriété identifiant quel que soit son nom réel. Une des conséquences de cette décision fut que les propriétés de non-identifiant appelées <literal>id</literal> ne pouvaient jamais être référencées dans les requêtes Hibernate.

source: The select clause
fr_fr: La clause select

source: The <literal>select</literal> clause picks which objects and properties to return in the query result set. Consider the following:
fr_fr: La clause <literal>select</literal> sélectionne les objets et propriétés qui doivent être retournés dans le résultat de la requête. Soit :

source: The query will select <literal>mate</literal>s of other <literal>Cat</literal>s. You can express this query more compactly as:
fr_fr: La requête recherchera les <literal>mate</literal> s liés aux <literal>Cat</literal> s. Vous pouvez exprimer cette requête de manière plus compacte :

source: Queries can return properties of any value type including properties of component type:
fr_fr: Les requêtes peuvent retourner des propriétés de n'importe quel type de valeur, même celles de type composant :

source: Queries can return multiple objects and/or properties as an array of type <literal>Object[]</literal>:
fr_fr: Les requêtes peuvent retourner de multiples objets et/ou propriétés sous la forme d'un tableau du type <literal>Object[]</literal> :

source: Or as a <literal>List</literal>:
fr_fr: Ou sous la forme d'une <literal>List</literal> :

source: Or - assuming that the class <literal>Family</literal> has an appropriate constructor - as an actual typesafe Java object:
fr_fr: Ou bien - à condition que la classe <literal>Family</literal> possède le constructeur approprié - en tant qu'objet typesafe Java :

source: You can assign aliases to selected expressions using <literal>as</literal>:
fr_fr: Vous pouvez assigner des alias aux expressions sélectionnées en utilisant <literal>as</literal> :

source: This is most useful when used together with <literal>select new map</literal>:
fr_fr: C'est surtout utile lorsque c'est utilisé avec <literal>select new map</literal> :

source: This query returns a <literal>Map</literal> from aliases to selected values.
fr_fr: Cette requête retourne une <literal>Map</literal> à partir des alias vers les valeurs sélectionnées.

source: Aggregate functions
fr_fr: Fonctions d'agrégation

source: HQL queries can even return the results of aggregate functions on properties:
fr_fr: Les requêtes HQL peuvent aussi retourner les résultats de fonctions d'agrégation sur les propriétés :

source: The supported aggregate functions are:
fr_fr: Les fonctions d'agrégation supportées sont :

source: You can use arithmetic operators, concatenation, and recognized SQL functions in the select clause:
fr_fr: Vous pouvez utiliser des opérateurs arithmétiques, la concaténation, et des fonctions SQL reconnues dans la clause select :

source: The <literal>distinct</literal> and <literal>all</literal> keywords can be used and have the same semantics as in SQL.
fr_fr: Les mots clé <literal>distinct</literal> et <literal>all</literal> peuvent être utilisés et ont la même sémantique qu'en SQL.

source: Polymorphic queries
fr_fr: Requêtes polymorphiques

source: A query like:
fr_fr: Une requête comme :

source: returns instances not only of <literal>Cat</literal>, but also of subclasses like <literal>DomesticCat</literal>. Hibernate queries can name <emphasis>any</emphasis> Java class or interface in the <literal>from</literal> clause. The query will return instances of all persistent classes that extend that class or implement the interface. The following query would return all persistent objects:
fr_fr: retourne non seulement les instances de <literal>Cat</literal>, mais aussi celles des sous classes comme <literal>DomesticCat</literal>. Les requêtes Hibernate peuvent nommer n'importe quelle classe ou interface Java dans la clause <literal>from</literal>. La requête retournera les instances de toutes les classes persistantes qui étendent cette classe ou implémente cette interface. La requête suivante retournera tous les objets persistants :

source: The interface <literal>Named</literal> might be implemented by various persistent classes:
fr_fr: L'interface <literal>Named</literal> peut être implémentée par plusieurs classes persistantes :

source: These last two queries will require more than one SQL <literal>SELECT</literal>. This means that the <literal>order by</literal> clause does not correctly order the whole result set. It also means you cannot call these queries using <literal>Query.scroll()</literal>.
fr_fr: Notez que ces deux dernières requêtes nécessitent plus d'un SQL <literal>SELECT</literal>. Ce qui signifie que la clause <literal>order by</literal> ne trie pas correctement la totalité des résultats (cela signifie aussi que vous ne pouvez exécuter ces requêtes en appelant <literal>Query.scroll()</literal>).

source: The where clause
fr_fr: La clause where

source: The <literal>where</literal> clause allows you to refine the list of instances returned. If no alias exists, you can refer to properties by name:
fr_fr: La clause <literal>where</literal> vous permet de réduire la liste des instances retournées. Si aucun alias n'existe, vous pouvez vous référer aux propriétés par leur nom :

source: If there is an alias, use a qualified property name:
fr_fr: S'il y a un alias, utilisez un nom de propriété qualifié :

source: This returns instances of <literal>Cat</literal> named 'Fritz'.
fr_fr: Retourne les instances de <literal>Cat</literal> appelé 'Fritz'.

source: The following query:
fr_fr: La requête suivante :

source: returns all instances of <literal>Foo</literal> with an instance of <literal>bar</literal> with a <literal>date</literal> property equal to the <literal>startDate</literal> property of the <literal>Foo</literal>. Compound path expressions make the <literal>where</literal> clause extremely powerful. Consider the following:
fr_fr: retournera les instances de <literal>Foo</literal> pour lesquelles il existe une instance de <literal>bar</literal> avec la propriété <literal>date</literal> égale à la propriété <literal>startDate</literal> de <literal>Foo</literal>. Les expressions de chemin composées rendent la clause <literal>where</literal> extrêmement puissante. Soit :

source: This query translates to an SQL query with a table (inner) join. For example:
fr_fr: Cette requête se traduit en une requête SQL par une jointure interne de table. Si vous souhaitez écrire quelque chose comme :

source: would result in a query that would require four table joins in SQL.
fr_fr: vous finiriez avec une requête qui nécessiterait quatre jointures de table en SQL.

source: The <literal>=</literal> operator can be used to compare not only properties, but also instances:
fr_fr: L'opérateur <literal>=</literal> peut être utilisé pour comparer aussi bien des propriétés que des instances :

source: The second query is efficient and does not require a table join.
fr_fr: La seconde requête est particulièrement efficace. Aucune jointure n'est nécessaire !

source: Properties of composite identifiers can also be used. Consider the following example where <literal>Person</literal> has composite identifiers consisting of <literal>country</literal> and <literal>medicareNumber</literal>:
fr_fr: Les propriétés d'identifiants composites peuvent aussi être utilisées. Supposez que <literal>Person</literal> ait un identifiant composite composé de <literal>country</literal> et <literal>medicareNumber</literal>.

source: Once again, the second query does not require a table join.
fr_fr: Une fois de plus, la seconde requête ne nécessite pas de jointure de table.

source: The special property <literal>class</literal> accesses the discriminator value of an instance in the case of polymorphic persistence. A Java class name embedded in the where clause will be translated to its discriminator value.
fr_fr: De même, la propriété spéciale <literal>class</literal> accède à la valeur discriminante d'une instance dans le cas d'une persistance polymorphique. Le nom d'une classe Java incorporée dans la clause where sera traduite par sa valeur discriminante.

source: An "any" type has the special properties <literal>id</literal> and <literal>class</literal> that allows you to express a join in the following way (where <literal>AuditLog.item</literal> is a property mapped with <literal>&lt;any&gt;</literal>):
fr_fr: Un type "any" possède les propriétés particulières <literal>id</literal> et <literal>class</literal>, qui nous permettent d'exprimer une jointure de la manière suivante (là où <literal>AuditLog.item</literal> est une propriété mappée avec <literal>&lt;any&gt;</literal>) :

source: The <literal>log.item.class</literal> and <literal>payment.class</literal> would refer to the values of completely different database columns in the above query.
fr_fr: Dans la requête précédente, notez que <literal>log.item.class</literal> et <literal>payment.class</literal> feraient référence à des valeurs de colonnes de la base de données complètement différentes.

source: Expressions used in the <literal>where</literal> clause include the following:
fr_fr: Les expressions permises dans la clause <literal>where</literal> incluent :

source: mathematical operators: <literal>+, -, *, /</literal>
fr_fr: opérateurs mathématiques : <literal>+, -, *, /</literal>

source: binary comparison operators: <literal>=, &gt;=, &lt;=, &lt;&gt;, !=, like</literal>
fr_fr: opérateurs de comparaison binaire : <literal>=, &gt;=, &lt;=, &lt;&gt;, !=, like</literal>

source: logical operations <literal>and, or, not</literal>
fr_fr: opérations logiques : <literal>and, or, not</literal>

source: Parentheses <literal>( )</literal> that indicates grouping
fr_fr: Parenthèses <literal>( )</literal>, indiquant un regroupement

source: <literal>in</literal>, <literal>not in</literal>, <literal>between</literal>, <literal>is null</literal>, <literal>is not null</literal>, <literal>is empty</literal>, <literal>is not empty</literal>, <literal>member of</literal> and <literal>not member of</literal>
fr_fr: <literal>in</literal>, <literal>not in</literal>, <literal>between</literal>, <literal>is null</literal>, <literal>is not null</literal>, <literal>is empty</literal>, <literal>is not empty</literal>, <literal>member of</literal> et <literal>not member of</literal>

source: "Simple" case, <literal>case ... when ... then ... else ... end</literal>, and "searched" case, <literal>case when ... then ... else ... end</literal>
fr_fr: Cas simple <literal>case ... when ... then ... else ... end</literal>, et cas "searched", <literal>case when ... then ... else ... end</literal>

source: string concatenation <literal>...||...</literal> or <literal>concat(...,...)</literal>
fr_fr: concaténation de chaîne de caractères <literal>...||...</literal> ou <literal>concat(...,...)</literal>

source: <literal>second(...)</literal>, <literal>minute(...)</literal>, <literal>hour(...)</literal>, <literal>day(...)</literal>, <literal>month(...)</literal>, and <literal>year(...)</literal>
fr_fr: <literal>second(...)</literal>, <literal>minute(...)</literal>, <literal>hour(...)</literal>, <literal>day(...)</literal>, <literal>month(...)</literal>, <literal>year(...)</literal>,

source: Any function or operator defined by EJB-QL 3.0: <literal>substring(), trim(), lower(), upper(), length(), locate(), abs(), sqrt(), bit_length(), mod()</literal>
fr_fr: N'importe quelle fonction ou opérateur défini par EJB-QL 3.0 : <literal>substring(), trim(), lower(), upper(), length(), locate(), abs(), sqrt(), bit_length(), mod()</literal>
