Repository: ControlSystemStudio/cs-studio
Catalog: project/documentation/manual/src/main/docbook/*/content/query_criteria.po
Languages: fr_fr

source: Criteria Queries
fr_fr: Requêtes par critères

source: Hibernate features an intuitive, extensible criteria query API.
fr_fr: Hibernate offre une API d'interrogation par critères intuitive et extensible.

source: Creating a <literal>Criteria</literal> instance
fr_fr: Créer une instance de <literal>Criteria</literal>

source: The interface <literal>org.hibernate.Criteria</literal> represents a query against a particular persistent class. The <literal>Session</literal> is a factory for <literal>Criteria</literal> instances.
fr_fr: L'interface <literal>net.sf.hibernate.Criteria</literal> représente une requête sur une classe persistante donnée. La <literal>Session</literal> fournit les instances de <literal>Criteria</literal>.

source: Narrowing the result set
fr_fr: Restriction du résultat

source: An individual query criterion is an instance of the interface <literal>org.hibernate.criterion.Criterion</literal>. The class <literal>org.hibernate.criterion.Restrictions</literal> defines factory methods for obtaining certain built-in <literal>Criterion</literal> types.
fr_fr: Un critère de recherche (criterion) individuel est une instance de l'interface <literal>org.hibernate.criterion.Criterion</literal>. La classe <literal>org.hibernate.criterion.Restrictions</literal> définit des méthodes de fabrique pour obtenir des types de <literal>Criterion</literal> intégrés.

source: Restrictions can be grouped logically.
fr_fr: Les restrictions peuvent être groupées de manière logique.

source: There are a range of built-in criterion types (<literal>Restrictions</literal> subclasses). One of the most useful allows you to specify SQL directly.
fr_fr: Il y a un grand choix de types de critères intégrés (sous classes de <literal>Restriction</literal>), dont un est particulièrement utile puisqu'il vous permet de spécifier directement SQL.

source: The <literal>{alias}</literal> placeholder with be replaced by the row alias of the queried entity.
fr_fr: La zone <literal>{alias}</literal> sera remplacée par l'alias de colonne de l'entité que l'on souhaite interroger.

source: You can also obtain a criterion from a <literal>Property</literal> instance. You can create a <literal>Property</literal> by calling <literal>Property.forName()</literal>:
fr_fr: Une autre approche pour obtenir un critère est de le récupérer d'une instance de <literal>Property</literal>. Vous pouvez créer une <literal>Property</literal> en appelant <literal>Property.forName()</literal>.

source: Ordering the results
fr_fr: Trier les résultats

source: You can order the results using <literal>org.hibernate.criterion.Order</literal>.
fr_fr: Vous pouvez trier les résultats en utilisant <literal>org.hibernate.criterion.Order</literal>.

source: By navigating associations using <literal>createCriteria()</literal> you can specify constraints upon related entities:
fr_fr: En naviguant les associations qui utilisent <literal>createCriteria()</literal>, vous pouvez spécifier des contraintes associées à des entités :

source: The second <literal>createCriteria()</literal> returns a new instance of <literal>Criteria</literal> that refers to the elements of the <literal>kittens</literal> collection.
fr_fr: Notez que la seconde <literal>createCriteria()</literal> retourne une nouvelle instance de <literal>Criteria</literal>, qui se rapporte aux éléments de la collection <literal>kittens</literal>.

source: There is also an alternate form that is useful in certain circumstances:
fr_fr: La forme alternative suivante est utile dans certains cas :

source: (<literal>createAlias()</literal> does not create a new instance of <literal>Criteria</literal>.)
fr_fr: (<literal>createAlias()</literal> ne crée pas de nouvelle instance de <literal>Criteria</literal>.)

source: The kittens collections held by the <literal>Cat</literal> instances returned by the previous two queries are <emphasis>not</emphasis> pre-filtered by the criteria. If you want to retrieve just the kittens that match the criteria, you must use a <literal>ResultTransformer</literal>.
fr_fr: Notez que les collections kittens contenues dans les instances de <literal>Cat</literal> retournées par les deux précédentes requêtes ne sont <emphasis>pas</emphasis> pré-filtrées par les critères ! Si vous souhaitez récupérer uniquement les kittens correspondant aux critères, vous devez utiliser <literal>ResultTransformer</literal>.

source: Dynamic association fetching
fr_fr: Peuplement d'associations de manière dynamique

source: You can specify association fetching semantics at runtime using <literal>setFetchMode()</literal>.
fr_fr: Vous pouvez spécifier, au moment de l'exécution, le peuplement d'une association en utilisant <literal>setFetchMode()</literal>.

source: Example queries
fr_fr: Requêtes par l'exemple

source: The class <literal>org.hibernate.criterion.Example</literal> allows you to construct a query criterion from a given instance.
fr_fr: La classe <literal>org.hibernate.criterion.Example</literal> vous permet de construire un critère de requête à partir d'une instance d'objet donnée.

source: Version properties, identifiers and associations are ignored. By default, null valued properties are excluded.
fr_fr: Les propriétés de type version, identifiant et association sont ignorées. Par défaut, les valeurs null sont exclues.

source: You can adjust how the <literal>Example</literal> is applied.
fr_fr: Vous pouvez ajuster la stratégie d'utilisation de valeurs de l'<literal>Exemple</literal>.

source: You can even use examples to place criteria upon associated objects.
fr_fr: Vous pouvez utiliser les "exemples" pour des critères sur des objets associés.

source: Projections, aggregation and grouping
fr_fr: Projections, agrégation et regroupement

source: The class <literal>org.hibernate.criterion.Projections</literal> is a factory for <literal>Projection</literal> instances. You can apply a projection to a query by calling <literal>setProjection()</literal>.
fr_fr: La classe <literal>org.hibernate.criterion.Projections</literal> est une fabrique d'instances de <literal>Projection</literal>. Nous appliquons une projection sur une requête en appelant <literal>setProjection()</literal>.

source: There is no explicit "group by" necessary in a criteria query. Certain projection types are defined to be <emphasis>grouping projections</emphasis>, which also appear in the SQL <literal>group by</literal> clause.
fr_fr: Il n'y a pas besoin de "group by" explicite dans une requête par critère. Certains types de projection sont définis pour être des <emphasis>projections de regroupement</emphasis>, qui apparaissent aussi dans la clause SQL <literal>group by</literal>.

source: An alias can be assigned to a projection so that the projected value can be referred to in restrictions or orderings. Here are two different ways to do this:
fr_fr: Un alias peut optionnellement être assigné à une projection, ainsi la valeur projetée peut être référencée dans des restrictions ou des tris. À cet effet, voici deux procédés différents :

source: The <literal>alias()</literal> and <literal>as()</literal> methods simply wrap a projection instance in another, aliased, instance of <literal>Projection</literal>. As a shortcut, you can assign an alias when you add the projection to a projection list:
fr_fr: Les méthodes <literal>alias()</literal> et <literal>as()</literal> enveloppent simplement une instance de projection dans une autre instance (aliasée) de <literal>Projection</literal>. Pour un raccourci, vous pouvez assigner un alias lorsque vous ajoutez la projection à une liste de projections :

source: You can also use <literal>Property.forName()</literal> to express projections:
fr_fr: Vous pouvez aussi utiliser <literal>Property.forName()</literal> pour formuler des projections :

source: Detached queries and subqueries
fr_fr: Requêtes et sous-requêtes détachées

source: The <literal>DetachedCriteria</literal> class allows you to create a query outside the scope of a session and then execute it using an arbitrary <literal>Session</literal>.
fr_fr: La classe <literal>DetachedCriteria</literal> vous laisse créer une requête en dehors de la portée de la session, et puis l'exécuter plus tard en utilisant une <literal>Session</literal> arbitraire.

source: A <literal>DetachedCriteria</literal> can also be used to express a subquery. Criterion instances involving subqueries can be obtained via <literal>Subqueries</literal> or <literal>Property</literal>.
fr_fr: Les <literal>DetachedCriteria</literal> peuvent aussi être utilisés pour exprimer une sous-requête. Des instances de critère impliquant des sous-requêtes peuvent être obtenues via <literal>Subqueries</literal> ou <literal>Property</literal>.

source: Correlated subqueries are also possible:
fr_fr: Des sous-requêtes corrélées sont également possibles :

source: Queries by natural identifier
fr_fr: Requêtes par identifiant naturel

source: For most queries, including criteria queries, the query cache is not efficient because query cache invalidation occurs too frequently. However, there is a special kind of query where you can optimize the cache invalidation algorithm: lookups by a constant natural key. In some applications, this kind of query occurs frequently. The criteria API provides special provision for this use case.
fr_fr: Pour la plupart des requêtes, incluant les requêtes par critère, le cache de requêtes n'est pas très efficace, parce que l'invalidation du cache de requêtes arrive trop souvent. Cependant, il y existe une requête spéciale où l'on peut optimiser l'algorithme d'invalidation du cache : les recherches par une clef naturelle constante. Dans certaines applications, ce genre de requête se produit fréquemment. L'API des critères fournit une disposition spéciale pour ce cas d'utilisation.

source: First, map the natural key of your entity using <literal>&lt;natural-id&gt;</literal> and enable use of the second-level cache.
fr_fr: D'abord, vous devrez mapper la clé naturelle de votre entité en utilisant <literal>&lt;natural-id&gt;</literal>, et activer l'utilisation du cache de second niveau.

source: This functionality is not intended for use with entities with <emphasis>mutable</emphasis> natural keys.
fr_fr: Cette fonctionnalité n'est pas prévue pour l'utilisation avec des entités avec des clés naturelles <emphasis>mutables</emphasis>.

source: Once you have enabled the Hibernate query cache, the <literal>Restrictions.naturalId()</literal> allows you to make use of the more efficient cache algorithm.
fr_fr: Une fois que vous aurez activé le cache de requête d'Hibernate, <literal>Restrictions.naturalId()</literal> vous permettra de rendre l'utilisation de l'algorithme de cache plus efficace.
