<?xml version='1.0' encoding='iso-8859-1'?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de" dir="ltr">

<head>
	<meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"/>
	<title> Insert Title here </title>
</head>

<body>

<h1>AuthorizeId</h1>
<p>
'Authorize Id' ist ein Plugin f&uuml;r CSS, 
welches mit LDAP-Eintr&auml;gen arbeitet, die in der Gruppe EpicsAuthorizeID sind.
Dies Plugin kann Eintr&auml;ge darstellen, neue Eintr&auml;ge erzeugen, Eintr&auml;ge editieren und l&ouml;schen.
Eintr&auml;ge in der ersten Tabelle sind Namen, in der zweiten Tabelle sind Attribute dieser Namen.
Wird ein Name editiert oder gel&ouml;scht, werden auch alle Attribute automatisch 
editiert oder gel&ouml;scht.
<br/>
</p>
<h3>If entry name is not valid?</h3>
<p>
Das Plugin verhindert, dass ung&uuml;ltige Namen eingegeben werden; 
z.B. leere Namen oder Namen mit von LDAP nicht unterst&uuml;tzten Zeichen.
</p>
<br/>

<h3>Tips and tricks</h3>
<p>
Um Feldnamen oder Attribute schnell zu finden, kann man sie einfach eintippen; es wird automatisch 
auf die Zeile gesprungen, wo sie vorkommen. Main kann auch auf Spaltenk&ouml;pfe klicken, um die Namen oder
Attribute alfabetisch zu sortieren.
<br/><br/>
Der Text, der auf dem Bildschirm erscheint, kann in einer Datei namens "messages.properties" ge&auml;ndert werden.
<br/>
Die Timeout-Vorgaben f&uuml;r LDAP-Datenzugriffe k&ouml;nnen in Klassen : LdapEain, LdapGroups und LdapProp 
ge&auml;ndert werden, wenn sie zu gro&szlig; oder zu klein sind.
<br/>
</p>
<h4>BUGS:</h4>
<p>
---
<br/>
<font size="2">
Ein Fehler passiert unter speziellen Umst&auml;nden, beispielsweise, wenn CSS einige Zeit nicht l&auml;uft
(PC ist aus) und wenn man CSS neu startet und AuthorizeId zum ersten Mal startet, 
dann k&ouml;nnen Gruppen leer sein.
<br/><br/>
Der Grund f&uuml;r diesen Fehler ist unklar, aber der Author nimm an, das es beim erstmaligen 
Verbinden mit LDAP ein Timing-Problem gibt.
<br/><br/>
<font color="red">
Schlie&szlig;e und wieder &Ouml;fnnen des Plugins beseitigt das Problem. Man mu&szlig; CSS nicht neu starten.
</font></font>
<br/>
---
<br/><br/>
<font color="red"><strong>
Bitte beachten : der Fehler ist beseitigt, aber um sicher zu sein, hat der Author diese 
Fehlerbeschreibung bestehen lassen, falls es nochmal &auml;hnliche Probleme gibt.	
</strong></font>
</p>
</body>
</html>
