<?xml version='1.0' encoding='iso-8859-1'?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de" dir="ltr">

<head>
	<meta content="text/html; charset=ISO-8859-1" http-equiv="content-type" />
	<title>Data Browser</title>
</head>

<body>

<h2>Internals: Sampling</h2>
<p>Jeder Datenwert hat einen timestamp, der ihn auf der X-Achse (=Zeit-Achse)
plaziert. F&uuml;r historische Daten werden die entsprechenden timestamps aus 
dem Archiv benutzt.
</p>
<p>
'live'-Daten haben normalerweise auch einen timestamp, der dem Kontrollsystem
mitteilt, wann ein Datenwert genommen wurde.
Aus verschiedenene Gr&uuml;nden kann der timestamp, wenn er im Datenbrowser ankommt,
um bis zu einige Sekunden von der aktuellen Uhrzeit abweichen.
Es gibt unvorhersehbare Netzwerk-Verz&ouml;gerungen; der Front-End-Computer kann
mit anderen Tasks als dem Senden von Updates besch&auml;ftigt sein, oder der Datenwert
hat sich einfach f&uuml;r eine lange Zeit nicht ge&auml;ndert und deswegen ist kein neuer
timestamp zugeordnet. Der letzte Grund gilt speziel f&uuml;r 'setpoint-type' PVs.
</p>
<p>
Alle Versuche, den Original 'live' timestamp zu verwenden, wenn ein
'scrolling stripchart' Display verwendet wird, sind fehlgeschlagen.

Offenbar m&ouml;chten wir die aktuelle Zeit an der rechten Kante des Displays anzeigen.
Angenommen, wir scrollen, d.h. aktualisieren die rechts angezeigte Zeit sek&uuml;ndlich.
Auch angenommen, dass wir einen Datensatz mit einem timestamp empfangen, der eine
Sekunde alt ist. Dann k&ouml;nnen wir den Datensatz eine Sekunde links von der rechten
Plot-Kante darstellen. Wenn eine Sekunde sp&auml;ter kein weiterer Datensatz ankommt,
k&ouml;nnen wir entweder eine zwei Sekunden lange L&uuml;cke ausgeben oder annehmen, dass der
Messwert sich nicht ge&auml;ndert hat und einfach den alten Messwert dauernd ausgeben.
Beide Verfahren sind zweifelhaft:

Wenn ein Messwert wie ein 'setpoint value' sich nur einmal w&ouml;chentlich &auml;ndert
und wir nur den einen Wert ausgeben, ist der Plot wunderbar leer,
obwohl Menschen annehmen w&uuml;rden, dass der Messwert konstant ist.
Andererseits, wenn wir einfach den letzten Messwert, beispielsweise 42, der einen
timestamp aus ferner Vergangenheit hat,  bis 'now' erweitern, indem wir eine
Gerade bei y=42 ziehen, und dann kommt vielleicht ein neuer Messwert, z.B. 43,
beispielsweise mit eine eine Sekunde alten timestamp, wird der Plot den Benutzer 
verwirren, weil der Wert auf der rechten Seite des Plots pl&ouml;tzlich f&uuml;r die letzen 
paar Sekunden von 42 nach 43 springt.
</p>
<p>
Das Resultat ist, dass der Datenbrowser 'live'-Daten so behandelt wie die
meisten anderen 'strip-chart' tools:
Jedem ankommenden Datenwert wird die aktuelle Wanduhrzeit zugeordnet.
In einem konsistenten Strip-Chart wird dies Ergebnis auf der rechten Seite 
des Plots dargestellt. Der Nachteil ist eine kleine Inkonsistenz von vielleicht 
ein paar Sekunden, wenn sp&auml;ter ein Schnappschuss von 'live'-Daten mit Archivdaten
verglichen wird, weil die Archivdaten den exakten timestamp enthalten, der 
mit einem Messwert &uuml;bertragen wurde.
</p>
</body>
</html>
