Repository: ControlSystemStudio/cs-studio
Catalog: project/documentation/manual/src/main/docbook/*/fallback_content/Conventions.po
Languages: pt_br, zh_cn

source: Document Conventions
pt_br: Convenções de Documento
zh_cn: 文档规则

source: This manual uses several conventions to highlight certain words and phrases and draw attention to specific pieces of information.
pt_br: Este manual usa diversas cenvenções para destacar certas palavras e frases dando atenção a pedaços específicos de informação.
zh_cn: 本手册使用了几种规则来突出某些文字和短语以及某些信息。

source: In PDF and paper editions, this manual uses typefaces drawn from the <ulink url="https://fedorahosted.org/liberation-fonts/">Liberation Fonts</ulink> set. The Liberation Fonts set is also used in HTML editions if the set is installed on your system. If not, alternative but equivalent typefaces are displayed. Note: Red Hat Enterprise Linux 5 and later includes the Liberation Fonts set by default.
pt_br: Nas edições em papel e em PDF, este manual usa faces de tipo retiradas do conjunto <ulink url="https://fedorahosted.org/liberation-fonts/">Liberation Fonts</ulink>. O conjunto Liberation Fonts é tasmbém usado nas edições caso o conjunto seja instalado no seu sistema. Caso contrário, prefácios alternativos porém equivalentes serão exibidos. Nota: O Red Hat Enterprise Linux 5 e versões mais avançadas incluem o conjunto Liberation Fonts por padrão.
zh_cn: 在 PDF 版本里，本手册使用 <ulink url="https://fedorahosted.org/liberation-fonts/">Liberation Fonts</ulink> 集里抽取的 typefaces。如果你安装了 Liberation Fonts 集，它也会用在 HTML 版本里。如果没有安装，则会使用其他相等的 typefaces。请注意，红帽企业版 Linux 5 和之后的版本缺省都包含了 Liberation Fonts 集。

source: Typographic Conventions
pt_br: Convenções de Tipografia
zh_cn: 印刷规则

source: Four typographic conventions are used to call attention to specific words and phrases. These conventions, and the circumstances they apply to, are as follows.
pt_br: Quatro convenções de tipografia são usadas para chamar a atenção às frases e palavras específicas. Estas convenções, e circunstâncias aplicadas pelas mesmas, são as seguintes:
zh_cn: 我们使用了四种印刷规则来突出特殊的文字和短语。下面是这些规则以及其适用的情况。

source: Used to highlight system input, including shell commands, file names and paths. Also used to highlight keycaps and key combinations. For example:
pt_br: Usada para destacar a entrada do sistema, incluindo comandos da janela de comandos, nomes de arquivos e caminhos. Além disso, usada para destacar teclas e combinações de teclas. Por exemplo:
zh_cn: 用来高亮显示系统输入，包括 shell 命令、文件名和路径。它也用于高亮显示键和键组合。例如：

source: To see the contents of the file <filename>my_next_bestselling_novel</filename> in your current working directory, enter the <command>cat my_next_bestselling_novel</command> command at the shell prompt and press <keycap>Enter</keycap> to execute the command.
pt_br: Para visualizar os conteúdos do <filename>my_next_bestselling_novel</filename> de arquivo no seu diretório atual, entre o comando <command>cat my_next_bestselling_novel</command> na janela de comandos e pressione <keycap>Enter</keycap> para executar o comando.
zh_cn: 要查看当前工作目录里的 <filename>my_next_bestselling_novel</filename> 的内容，请在 shell 提示符下输入 <command>cat my_next_bestselling_novel</command> 并按<keycap>Enter</keycap> 来执行命令。

source: The above includes a file name, a shell command and a keycap, all presented in mono-spaced bold and all distinguishable thanks to context.
pt_br: Segue acima um nome de arquivo, uma janela de comando e uma tecla, todos representados em negrito num espaço único, todos distinguíveis graças ao contexto.
zh_cn: 上面包括了一个文件名、一个 shell 命令和键，它们都以 mono-spaced bold 出现并和上下文区分。

source: Key combinations can be distinguished from keycaps by the hyphen connecting each part of a key combination. For example:
pt_br: As combinações de teclas podem se diferenciar das teclas por um hífen conectando cada parte de uma combinação de tecla. Por exemplo:
zh_cn: 键组合可以通过连字符和键来区分。例如：

source: Press <keycap>Enter</keycap> to execute the command.
pt_br: Pressione <keycap>Enter</keycap> para executar o comando.
zh_cn: 按 <keycap>Enter</keycap> 来执行这个命令。

source: Press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> to switch to the first virtual terminal. Press <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F7</keycap></keycombo> to return to your X-Windows session.
pt_br: Pressione <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> para mudar para o primeiro terminal virtual. Pressione <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F7</keycap></keycombo> para retornar à sua sessão X-Windows.
zh_cn: 按 <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F1</keycap></keycombo> 切换至第一个虚拟终端。按 <keycombo><keycap>Ctrl</keycap><keycap>Alt</keycap><keycap>F7</keycap></keycombo> 返回到 X-Windows 会话。

source: The first paragraph highlights the particular keycap to press. The second highlights two key combinations (each a set of three keycaps with each set pressed simultaneously).
pt_br: O primeiro parágrafo destaca uma tecla particular a se pressionar. O segundo destaca duas combinações de tecla (cada conjunto de três teclas com cada conjunto sendo pressionado simultâneamente).
zh_cn: 第一段高亮显示了特殊的键。第二段高亮显示了两个键组合（每个都由三个同时按住的键构成）。

source: If source code is discussed, class names, methods, functions, variable names and returned values mentioned within a paragraph will be presented as above, in <literal>mono-spaced bold</literal>. For example:
pt_br: Se o código de fonte for discutido, os nomes de classe, metodos, funções, nomes de variáveis e valores retornados mencionados com um parágrafo serão representados conforme acima, num <literal>mono-spaced bold</literal>. Por exemplo:
zh_cn: 在源码中提及的类名、方法、函数、变量和返回值都将以 <literal>mono-spaced bold</literal> 出现。例如：

source: File-related classes include <classname>filesystem</classname> for file systems, <classname>file</classname> for files, and <classname>dir</classname> for directories. Each class has its own associated set of permissions.
pt_br: As classes de arquivo relacionado incluem <classname>filesystem</classname> para sistemas de arquivo, <classname>file</classname> para arquivos e <classname>dir</classname> para diretórios. Cada classe possui o próprio conjunto de associação de permissões.
zh_cn: 文件相关的类包括用于文件系统的 <classname>filesystem</classname>、用于文件的 <classname>file</classname> 和用于目录的 <classname>dir</classname>。每个类都有自己的一套权限。

source: This denotes words or phrases encountered on a system, including application names; dialog box text; labeled buttons; check-box and radio button labels; menu titles and sub-menu titles. For example:
pt_br: As frases e palavras marcadas encontradas num sistema, incluindo nomes de aplicativos, texto de caixa de diálogo, botões etiquetados, caixa de checagem e etiquetas de botão de rádio; títulos de menu e títulos de sub-menu. Por exemplo:
zh_cn: 它表示系统里的文字或短语，包括程序名、对话框文本、标签按钮、复选框和单选框、菜单和子菜单标题。例如：

source: Choose <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Mouse</guimenuitem></menuchoice> from the main menu bar to launch <application>Mouse Preferences</application>. In the <guilabel>Buttons</guilabel> tab, click the <guilabel>Left-handed mouse</guilabel> check box and click <guibutton>Close</guibutton> to switch the primary mouse button from the left to the right (making the mouse suitable for use in the left hand).
pt_br: Escolha <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Mouse</guimenuitem></menuchoice> a partir do menu principal para lançar <application>Mouse Preferences</application>. Na aba <guilabel>Buttons</guilabel>, clique na caixa de checagem <guilabel>Left-handed mouse</guilabel> e clique <guibutton>Close</guibutton> para mudar para o botão de mouse primário da esquerda para a direita (fazendo com que o mouse seja apropriado para uso na mão esquerda).
zh_cn: 从主菜单选择 <menuchoice><guimenu>System</guimenu><guisubmenu>Preferences</guisubmenu><guimenuitem>Mouse</guimenuitem></menuchoice> 来启动 <application>Mouse Preferences</application>。在 <guilabel>Buttons</guilabel> 标签页里，点击 <guilabel>Left-handed mouse</guilabel> 复选框并点击 <guibutton>Close</guibutton> 来把鼠标主按钮从左切换到右（适合于习惯用左手的人）。

source: To insert a special character into a <application>gedit</application> file, choose <menuchoice><guimenu>Applications</guimenu><guisubmenu>Accessories</guisubmenu><guimenuitem>Character Map</guimenuitem></menuchoice> from the main menu bar. Next, choose <menuchoice><guimenu>Search</guimenu><guimenuitem>Find&hellip;</guimenuitem></menuchoice> from the <application>Character Map</application> menu bar, type the name of the character in the <guilabel>Search</guilabel> field and click <guibutton>Next</guibutton>. The character you sought will be highlighted in the <guilabel>Character Table</guilabel>. Double-click this highlighted character to place it in the <guilabel>Text to copy</guilabel> field and then click the <guibutton>Copy</guibutton> button. Now switch back to your document and choose <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem></menuchoice> from the <application>gedit</application> menu bar.
pt_br: Para inserir um caractere especial a um arquivo <application>gedit</application>, escolha <menuchoice><guimenu>Applications</guimenu><guisubmenu>Accessories</guisubmenu><guimenuitem>Character Map</guimenuitem></menuchoice> a partir da barra do menu principal. Depois, escolha <menuchoice><guimenu>Search</guimenu><guimenuitem>Find&hellip;</guimenuitem></menuchoice> a partir da barra do menu <application>Character Map</application>, digite o nome do caractere no campo <guilabel>Search</guilabel>e clique <guibutton>Next</guibutton>. O carctere que você avistar estará destacado no <guilabel>Character Table</guilabel>. Dê dois cliques no caractere em destaque para posicioná-lo no campo <guilabel>Text to copy</guilabel> e, então, clique no botão <guibutton>Copy</guibutton>. Agora retorne para o seu documento e escolha o <menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem></menuchoice> a partir da barra do menu <application>gedit</application>.
zh_cn: 要在 <application>gedit</application> 文件里插入特殊字符，从主菜单里选择 <menuchoice><guimenu>Applications</guimenu><guisubmenu>Accessories</guisubmenu><guimenuitem>Character Map</guimenuitem></menuchoice>。然后，从 <application>Character Map</application> 菜单条里选择 <menuchoice><guimenu>Search</guimenu><guimenuitem>Find&hellip;</guimenuitem></menuchoice>，在 <guilabel>Search</guilabel>字段里输入字符并点击 <guibutton>Next</guibutton>。你要搜索的字符会在 <guilabel>Character Table</guilabel> 里高亮显示。双击这个高亮显示的字符并放入 <guilabel>Text to copy</guilabel> 字段里，然后点击 <guibutton>Copy</guibutton> 按钮。现在切换回你的文档并从 <application>gedit</application> 菜单条里选择<menuchoice><guimenu>Edit</guimenu><guimenuitem>Paste</guimenuitem></menuchoice>。

source: The above text includes application names; system-wide menu names and items; application-specific menu names; and buttons and text found within a GUI interface, all presented in proportional bold and all distinguishable by context.
pt_br: O texto acima inclue nomes de aplicativos, nomes do menu de sistema amplo e ítens, nomes do menu específico do aplicativo, botões e textos encontrados com uma interface GUI, sendo que todos apresentados em negrito proporcional e todos distingüíveis por contexto.
zh_cn: 上面的内容包括了程序名称、系统级的菜单名和条目、程序专有的菜单名、图形界面里的按钮和文本，它们都以 proportional bold 出现并和其他内容区分。

source: <command><replaceable>Mono-spaced Bold Italic</replaceable></command> or <application><replaceable>Proportional Bold Italic</replaceable></application>
pt_br: <command><replaceable>Mono-spaced Bold Italic</replaceable></command> ou <application><replaceable>Proportional Bold Italic</replaceable></application>
zh_cn: <command><replaceable>Mono-spaced Bold Italic</replaceable></command> 或 <application><replaceable>Proportional Bold Italic</replaceable></application>

source: Whether mono-spaced bold or proportional bold, the addition of italics indicates replaceable or variable text. Italics denotes text you do not input literally or displayed text that changes depending on circumstance. For example:
pt_br: Se é que um negrito de espaço único ou negrito proporcional, a adição de itálico indica texto variável ou de substituição. O Itálico marca o texto em que você não inseriu literalmente ou texto exibido das quais as alterações dependem das circunstâncias. Por exemplo:
zh_cn: 无论是 mono-spaced bold 还是 proportional bold，斜体都表示可替换的或可变的文本。斜体表示非输入的文本，它根据周围的内容而变化。例如：

source: To connect to a remote machine using ssh, type <command>ssh <replaceable>username</replaceable>@<replaceable>domain.name</replaceable></command> at a shell prompt. If the remote machine is <filename>example.com</filename> and your username on that machine is john, type <command>ssh john@example.com</command>.
pt_br: Para conectar uma máquina remota usando ssh, digite <command>ssh <replaceable>username</replaceable>@<replaceable>domain.name</replaceable></command> na janela de comandos. Caso a máquina remota for <filename>example.com</filename> e se o seu nome do usuário na máquina for john, digite <command>ssh john@example.com</command>.
zh_cn: 要用 ssh 连接到远程机器，在 shell 提示下输入 <command>ssh <replaceable>username</replaceable>@<replaceable>domain.name</replaceable></command>。如果这个远程主机是 <filename>example.com</filename> 且你的用户名是 john，请输入 <command>ssh john@example.com</command>。

source: The <command>mount -o remount <replaceable>file-system</replaceable></command> command remounts the named file system. For example, to remount the <filename>/home</filename> file system, the command is <command>mount -o remount /home</command>.
pt_br: O comando <command>mount -o remount <replaceable>file-system</replaceable></command> remonta o sistema do arquivo nomeado. Por exemplo, para remontar o sistema de arquivo, o comando é <command>mount -o remount /home</command>.
zh_cn: <command>mount -o remount <replaceable>file-system</replaceable></command> 命令重新挂载文件系统。例如，要重新挂载 <filename>/home</filename>，命令是 <command>mount -o remount /home</command>。

source: To see the version of a currently installed package, use the <command>rpm -q <replaceable>package</replaceable></command> command. It will return a result as follows: <command><replaceable>package-version-release</replaceable></command>.
pt_br: Para verificar a versão de um pacote instalado, use o comando <command>rpm -q <replaceable>package</replaceable></command>. Isto retornará a um resultado como o seguinte: <command><replaceable>package-version-release</replaceable></command>.
zh_cn: 要查看当前安装的软件包的版本，你可以使用 <command>rpm -q <replaceable>package</replaceable></command> 命令。它将返回这样的结果集：<command><replaceable>package-version-release</replaceable></command>。

source: Note the words in bold italics above &mdash; username, domain.name, file-system, package, version and release. Each word is a placeholder, either for text you enter when issuing a command or for text displayed by the system.
pt_br: Perceba que estas palavras italicas em negrito acima &mdash; nome do usuário, domain.name, sistema-arquivo, versão e liberação. Cada palavra é uma marcação, tanto para o texto que você entrar enquanto emitindo um comando ou para o texto exibido pelo sistema.
zh_cn: 请注意上面字体为粗斜体的文字 &mdash; username, domain.name, file-system, package, version 和 release。无论是你输入的命令还是系统显示的文本，每个文字都是一个占位符。

source: Aside from standard usage for presenting the title of a work, italics denotes the first use of a new and important term. For example:
pt_br: Além do uso padrão para apresentação do título de um trabalho, o itálico marca o primeiro uso de um novo e importante termo. Por exemplo:
zh_cn: 除了表示标题的标准用法之外，斜体表示新的和重要的术语的第一次使用。例如：

source: Publican is a <firstterm>DocBook</firstterm> publishing system.
pt_br: Publican é um sistema de publicação <firstterm>DocBook</firstterm>.
zh_cn: Publican 是一个基于 <firstterm>DocBook</firstterm> 的发布系统。

source: Pull-quote Conventions
pt_br: Convenções Pull-quote
zh_cn: 副标题规则

source: Terminal output and source code listings are set off visually from the surrounding text.
pt_br: As listagens de código e saída de terminal são configuradas fora da visão do texto ao redor.
zh_cn: 终端输出和源代码列表由周围的文本来烘托。

source: Output sent to a terminal is set in <computeroutput>mono-spaced roman</computeroutput> and presented thus:
pt_br: O envio de saída ao terminal é configurado no <computeroutput>mono-spaced roman</computeroutput> e apresentado conforme:
zh_cn: 发送到终端的输出在 <computeroutput>mono-spaced roman</computeroutput> 设置且以这种形式出现：

source: Source-code listings are also set in <computeroutput>mono-spaced roman</computeroutput> but add syntax highlighting as follows:
pt_br: As listagens de código de fonte são também configuradas em <computeroutput>mono-spaced roman</computeroutput>, porém adicionam destaque de sintáxe conforme:
zh_cn: 源码列表也在 <computeroutput>mono-spaced roman</computeroutput> 里设置但添加了如下的语法高亮显示：

source: Notes and Warnings
pt_br: Notas e Avisos
zh_cn: 注意和警告

source: Finally, we use three visual styles to draw attention to information that might otherwise be overlooked.
pt_br: Finalmente, nós usamos três estilos visuais para chamar atenção à informação que poderia ser de outra forma negligenciada.
zh_cn: 最后，我们使用三章可视风格来引起对可能被忽视的信息的注意。

source: Note
pt_br: Nota
zh_cn: 注意

source: Notes are tips, shortcuts or alternative approaches to the task at hand. Ignoring a note should have no negative consequences, but you might miss out on a trick that makes your life easier.
pt_br: As notas são dicas, atalhos ou abordagens alternativas à tarefa em mãos. Não há problema algum em ignorar uma nota, porém você poderá peder a chance de aprender uma forma mais fácil.
zh_cn: 注意是完成手中任务的提示、快捷方式或其他方法。忽略”注意“不会产生负面影响，但你可能会错失使你受益的技巧。

source: Important
pt_br: Importante
zh_cn: 重要信息

source: Important boxes detail things that are easily missed: configuration changes that only apply to the current session, or services that need restarting before an update will apply. Ignoring a box labeled 'Important' won't cause data loss but may cause irritation and frustration.
pt_br: As caixas importante detalham coisas que são facilmentye esquecidas: alterações de configuração que apenas aplica a sessão atual ou serviços que precisam ser reiniciados antes que uma atualização seja aplicada. Você não perderá dado algum ignorando uma caixa chamada 'Importante', mas poderá se irritar ou frustar.
zh_cn: 重要信息显示容易被错过的信息：只适用于当前会话的配置改动、或需要重启来生效的服务。忽略标记为”重要信息“的对话框不会导致数据丢失但会引发问题。

source: Warning
pt_br: Aviso
zh_cn: 警告

source: Warnings should not be ignored. Ignoring warnings will most likely cause data loss.
pt_br: Os avisos não devem ser ignorados. Você provavelmente perderá dados, caso um aviso seja ignorado.
zh_cn: 警告不应该被忽略。忽略警告将导致数据丢失。
