<?xml version='1.0' encoding='iso-8859-1'?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="de" lang="de" dir="ltr">

<head>
	<meta content="text/html; charset=ISO-8859-1" http-equiv="content-type"/>
	<title>Wert Speichern</title>
</head>

<body>
<h1>Wert Speichern</h1>

<p>Die Funktion &quot;Wert Speichern&quot; dient dazu, den f&uuml;r eine Prozessvariable
gesetzten Wert dauerhaft abzuspeichern, so dass dieser beim n&auml;chsten Booten der zugeh&ouml;rigen
IOC automatisch wieder gesetzt wird.</p>

<h2>Aufruf der Funktion</h2>

<p>Die Funktion steht im Kontextmenu SDS-Widgets zur Verf&uuml;gung, die das
Ver&auml;ndern von Werten erm&ouml;glichen (Texteingabe, Schieberegler). Der Men&uuml;
steht auch bei anderen Objekten zur Verf&uuml;gung, die eine Prozessvariable und
einen Wert beinhalten.</p>

<p>
<img src="screenshot_contextmenu.png" 
	alt="Die Funktion Wert Speichern befindet 
	sich im Untermenu des Kontextmenus ..." />
</p>

<p>
Nach Aufruf der Funktion &uuml;ber das Kontextmenu erscheint das
Dialogfenster &quot;Wert Speichern&quot;.
</p>

<h2>Das Dialogfenster &quot;Wert Speichern&quot;</h2>

<p><img src="screenshot_dialog_start.png" alt="" title="" /></p>

<p>
In diesem Dialogfenster kann vor dem Speichern noch einmal gepr&uuml;ft werden,
ob der zu speichernde Wert korrekt ist. Im oberen Teil des Dialogfensters
werden die Prozessvariable, der zugeh&ouml;rige IOC und der Wert angezeigt. Zum
Abspeichern des Wertes muss die Schaltfl&auml;che &quot;Speichern&quot; gedr&uuml;ckt werden.
</p>

<p>
Nach Anklicken von &quot;Speichern&quot; wird der Wert mit Hilfe mehrerer
technischer Dienste auf einem Server gespeichert. Der Ablauf des
Speichervorgangs wird in dem Dialogfenster angezeigt. Nach Abschluss wird in dem
Dialogfenster das Ergebnis jedes einzelnen Dienstes angezeigt. Im unteren Teil
des Dialogs wird angegeben, ob der Speichervorgang insgesamt erfolgreich war.
Der folgende Screenshot zeigt den Dialog nach dem erfolgreichen Speichern eines
Wertes:
</p>

<p><img src="screenshot_dialog_success.png" alt="Meldung im Dialogfenster: Der Wert wurde erfolgreich gespeichert" title="" /></p>

<p>Das Ergebnis f&uuml;r die ersten beiden Schritte, &quot;Dienst nicht verf&uuml;gbar&quot;,
kann in diesem Beispiel ignoriert werden, da es sich bei den beiden Diensten
um nicht erforderliche Dienste handelt. Erkennbar ist dies an der ausgegrauten
Darstellung der Fehlermeldungen. (Siehe auch Abschnitt &quot;Fehlermeldungen&quot;)</p>

<p>Konnte der Wert nicht gespeichert werden, werden ein Fehlersymbol und eine
entsprechende Meldung angezeigt:</p>

<p><img src="screenshot_dialog_fail.png" alt="Meldung im Dialogfenster: Ein Fehler ist 
	 aufgetreten. Der Wert wurde NICHT gespeichert!" title="" /></p>

<p>Die tabellarische Darstellung der Ergebnisse der einzelnen Dienste gibt in
diesem Fall einen genaueren Hinweis auf die Fehlerursache. In dem Beispiel aus
dem Screenshot konnte keine Verbindung zum Server hergestellt werden.</p>

<h2>Fehlermeldungen</h2>

<p>Dieser Abschnitt liefert einen &Uuml;berblick &uuml;ber die m&ouml;glichen Fehlermeldungen,
die bei der Verwendung der Wert-Speichern-Funktion erscheinen k&ouml;nnen, und die
jeweiligen Fehlerursachen.</p>

<ul>
<li>
<p>Direkt nach dem Aufruf der Funktion aus dem Kontextmenu erscheint die
Fehlermeldung: <em>Kein Dienst ist als erforderlich konfiguriert. 
Bitte konfigurieren Sie in den Einstellungen mindestens einen Dienst als erforderlich.</em></p>
<p>In den Benutzereinstellungen (Preferences) ist keiner der m&ouml;glichen Dieste
als &quot;erforderlicher Dienst&quot; ausgew&auml;hlt. Erforderliche Dienste sind die
Dienste, bei denen das Speichern erfolgreich sein muss, damit der Wert insgesamt
gespeichert ist. Wenn keiner der Dienste als erforderlich konfiguriert ist, kann
die Wert-Speichern-Funktion nicht feststellen, ob ein Wert erfolgreich
gespeichert wurde.</p>
</li>

<li>
<p>Direkt nach dem Aufruf der Funktion aus dem Kontextmenu erscheint die
Fehlermeldung: <em>Der IOC f&uuml;r  Prozessvariable wurde nicht gefunden.</em></p>
<p>Der Datensatz f&uuml;r die Prozessvariable ist nicht im LDAP-Verzeichnis
konfiguriert.</p>
</li>

<li>
<p>Nach dem Dr&uuml;cken der Schaltfl&auml;che &quot;Speichern&quot; erscheint die Meldung:
<em>Konnte keine Verbindung zur RMI-Registrierung aufbauen: [weitere Details]</em></p>
<p>&Uuml;ber die RMI-Registry finde die Funktion die zur Durchf&uuml;hrung n&ouml;tigen
serverseitigen Dienste. Stellen Sie sicher, dass die Registry in den
Benutzereinstellungen (Preferences) richtig konfiguriert ist. Die in der
Fehlermeldung angegebenen Details geben m&ouml;glicherweise weitere Hinweise
auf die Fehlerursache.</p>
</li>

<li>
<p>Als Ergebnis eines Schrittes wird gemeldet: <em>Zeit&uuml;berschreitung</em></p>
<p>Der Dienst hat nicht innerhalb einer vorgegebenen Zeitspanne (f&uuml;r Sekunden)
geantwortet. Eventuell ist bei der Verarbeitung auf dem Server ein Problem
aufgetreten.</p>
<p>Wenn der Dienst ein erforderlicher Dienst ist, erscheint diese
Fehlermeldung in roter Farbe und das Speichern des Wertes ist fehlgeschlagen.
Handelt es sich nicht um einen erforderlichen Dienst, erscheint die Meldung
in grauer Farbe und kann ignoriert werden.</p>
</li>

<li>
<p>Als Ergebnis eines Schrittes wird gemeldet: <em> Dienst nicht verf&uuml;gbar.</em></p>
<p>Der Dienst wird vom Server nicht angeboten.</p>
<p>Wenn der Dienst ein erforderlicher Dienst ist, erscheint diese
Fehlermeldung in roter Farbe und das Speichern des Wertes ist fehlgeschlagen.
Handelt es sich nicht um einen erforderlichen Dienst, erscheint die Meldung
in grauer Farbe und kann ignoriert werden.</p>
</li>

<li>
<p>Als Ergebnis eines Schrittes wird gemeldet: <em>Verbindungsfehler: [Details]</em></p>
<p>Beim Aufruf des Dienstes auf dem Server ist ein technisches Problem
aufgetreten. Die in der Fehlermeldung aufgef&uuml;hrten Details geben weitere
Hinweise auf die Fehlerursache.</p>
<p>Wenn der Dienst ein erforderlicher Dienst ist, erscheint diese
Fehlermeldung in roter Farbe und das Speichern des Wertes ist fehlgeschlagen.
Handelt es sich nicht um einen erforderlichen Dienst, erscheint die Meldung
in grauer Farbe und kann ignoriert werden.</p>
</li>

<li>
<p>Als Ergebnis eines Schrittes wird gemeldet: <em>Dienstfehler: [Details]</em></p>
<p>Der serverseitige Dienst hat die Anfrage erhalten, bei der Bearbeitung ist
jedoch ein Fehler aufgetreten. Die Details in der Fehlermeldung geben weitere
Hinweise zur Fehlerursache.</p>
<p>Wenn der Dienst ein erforderlicher Dienst ist, erscheint diese
Fehlermeldung in roter Farbe und das Speichern des Wertes ist fehlgeschlagen.
Handelt es sich nicht um einen erforderlichen Dienst, erscheint die Meldung
in grauer Farbe und kann ignoriert werden.</p>
</li>

</ul>

</body>
</html>